
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第三章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-ancre-navigation/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="gitbook/website.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="Chap2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Chap1.html">
            
                <a href="Chap1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="Chap2.html">
            
                <a href="Chap2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="Chap3.html">
            
                <a href="Chap3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第三章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x7B2C;&#x4E09;&#x7AE0;"><a name="&#x7B2C;&#x4E09;&#x7AE0;" class="anchor-navigation-ex-anchor" href="#&#x7B2C;&#x4E09;&#x7AE0;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7B2C;&#x4E09;&#x7AE0;</h2>
<h3 id="31-&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#x4ECB;&#x7ECD;"><a name="31-&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#x4ECB;&#x7ECD;" class="anchor-navigation-ex-anchor" href="#31-&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#x4ECB;&#x7ECD;"><i class="fa fa-link" aria-hidden="true"></i></a>3.1 &#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#x4ECB;&#x7ECD;</h3>
<p>&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#x534F;&#x8BAE;&#x63D0;&#x4F9B;&#x5E94;&#x7528;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x903B;&#x8F91;&#x901A;&#x4FE1;,&#x6240;&#x8C13;&#x7684;&#x903B;&#x8F91;&#x901A;&#x4FE1;&#x662F;&#x6307;&#x4ECE;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BB2;&#xFF0C;host&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x4EFF;&#x4F5B;&#x662F;&#x76F4;&#x63A5;&#x76F8;&#x8FDE;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x5C3D;&#x7BA1;&#x7269;&#x7406;&#x5C42;&#x9762;&#x4E0A;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x76F8;&#x8DDD;&#x5F88;&#x8FDC;&#x3002;</p>
<p><img src="IMG/3-1-1-transport_perspective.PNG" alt=""></p>
<p>&#x6B63;&#x5982;&#x4E0A;&#x56FE;&#x4E2D;&#x6240;&#x793A;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x53E6;&#x4E00;&#x70B9;&#x662F;&#x7F51;&#x5173;&#x53EA;&#x4F5C;&#x7528;&#x4E8E;&#x7F51;&#x7EDC;&#x5C42;&#x90E8;&#x5206;&#x7684;datagram&#xFF0C;&#x4ED6;&#x4EEC;&#x5E76;&#x4E0D;&#x68C0;&#x6D4B;&#x5C01;&#x88C5;&#x5728;&#x8FD0;&#x8F93;&#x5C42;&#x7684;&#x90A3;&#x4E9B;datagram&#x3002;</p>
<h4 id="&#x8FD0;&#x8F93;&#x5C42;&#x548C;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x5173;&#x7CFB;"><a name="&#x8FD0;&#x8F93;&#x5C42;&#x548C;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x5173;&#x7CFB;" class="anchor-navigation-ex-anchor" href="#&#x8FD0;&#x8F93;&#x5C42;&#x548C;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x5173;&#x7CFB;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x8FD0;&#x8F93;&#x5C42;&#x548C;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x5173;&#x7CFB;</h4>
<p>&#x4E66;&#x91CC;&#x9762;&#x4E3E;&#x4E86;&#x4E00;&#x4E2A;&#x5F62;&#x8C61;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x7B80;&#x5316;&#x4E00;&#x4E0B;&#xFF1A;&#x5047;&#x8BBE;&#x5C0F;&#x660E;&#x4E00;&#x5BB6;10&#x51E0;&#x4E2A;&#x4EBA;&#x4F4F;&#x5728;&#x4E2D;&#x56FD;&#xFF0C;&#x5C0F;&#x5F20;&#x4E00;&#x5BB6;10&#x51E0;&#x4E2A;&#x4EBA;&#x4F4F;&#x5728;&#x7F8E;&#x56FD;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x597D;&#x670B;&#x53CB;&#x4E14;&#x7528;&#x90AE;&#x4EF6;&#x901A;&#x4FE1;&#x3002;&#x5C0F;&#x660E;&#x5BB6;&#x7684;&#x540C;&#x5B66;&#x4EEC;&#x628A;&#x5199;&#x597D;&#x7684;&#x4FE1;&#x4EF6;&#x4EA4;&#x7ED9;&#x5C0F;&#x660E;&#x5BB6;&#x7684;&#x770B;&#x95E8;&#x5927;&#x7237;&#xFF0C;&#x7531;&#x770B;&#x95E8;&#x5927;&#x7237;&#x6536;&#x96C6;&#x5206;&#x53D1;&#x3002;&#x770B;&#x95E8;&#x5927;&#x7237;&#x53EA;&#x9700;&#x8981;&#x5B9A;&#x5668;&#x7684;&#x628A;&#x90AE;&#x4EF6;&#x7ED9;&#x90AE;&#x5C40;&#x9001;&#x53BB;&#xFF0C;&#x6216;&#x8005;&#x7ED9;&#x90AE;&#x9012;&#x5458;&#x9001;&#x5230;&#x90AE;&#x5C40;&#x3002;&#x540C;&#x7406;&#x5C0F;&#x5F20;&#x5BB6;&#x4E5F;&#x662F;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x90AE;&#x9012;&#x670D;&#x52A1;&#x5C31;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x94FE;&#x63A5;&#xFF0C;&#x4ED6;&#x662F;&#x793E;&#x533A;&#x5BF9;&#x793E;&#x533A;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EBA;&#x5BF9;&#x4EBA;&#x3002;</p>
<p>&#x5BF9;&#x5E94;&#x7684;&#x7F51;&#x7EDC;&#x6982;&#x5FF5;:</p>
<p>&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x4FDD;&#x6587;:   &#x4FE1;&#x4EF6;&#x5185;&#x5BB9;
&#x8FDB;&#x7A0B;:           &#x5199;&#x4FE1;&#x7684;&#x8FD9;&#x4E9B;&#x4EBA;
hosts:          &#x5C0F;&#x660E;&#x4E00;&#x5BB6;,&#x5C0F;&#x5F20;&#x4E00;&#x5BB6;
&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;:     &#x770B;&#x95E8;&#x5927;&#x7237;
&#x7F51;&#x7EDC;&#x5C42;&#x534F;&#x8BAE;:     &#x90AE;&#x9012;&#x670D;&#x52A1;</p>
<p>&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#x53EA;&#x8D1F;&#x8D23;&#x628A;&#x5E94;&#x7528;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x62A5;&#x6587;&#x79FB;&#x52A8;&#x5230;&#x4E07;&#x5343;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#xFF0C;&#x5728;&#x90AE;&#x4EF6;&#x4E2D;&#x95F4;&#x4F20;&#x9012;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4ED6;&#x4EEC;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x7EC6;&#x8282;&#x3002;&#x5C31;&#x50CF;&#x770B;&#x95E8;&#x8001;&#x5927;&#x7237;&#x4E0D;&#x77E5;&#x9053;&#x90AE;&#x4EF6;&#x662F;&#x4ECE;&#x592A;&#x5E73;&#x6D0B;&#x5230;&#x7684;&#x7F8E;&#x56FD;&#xFF0C;&#x8FD8;&#x662F;&#x4ECE;&#x5927;&#x897F;&#x6D0B;&#x5230;&#x7684;&#x7F8E;&#x56FD;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5F00;&#x95E8;&#x5927;&#x7237;&#x2014;&#x2014;&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#x5E76;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x4EC0;&#x4E48;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4F1A;&#x88AB;&#x7F51;&#x7EDC;&#x5C42;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x6240;&#x9650;&#x5236;&#xFF0C;&#x5982;&#x679C;&#x7F51;&#x7EDC;&#x5C42;&#x4E0D;&#x63D0;&#x4F9B;&#x8D37;&#x6B3E;&#x548C;&#x65F6;&#x5EF6;&#x4FDD;&#x8BC1;&#x7684;&#x8BDD;&#xFF0C;&#x8FD0;&#x8F93;&#x5C42;&#x7684;&#x4FDD;&#x969C;&#x5C31;&#x65E0;&#x4ECE;&#x8C08;&#x8D77;&#x4E86;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;TCP&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x5373;&#x4F7F;&#x7F51;&#x7EDC;&#x5C42;&#x534F;&#x8BAE;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x3002;(?!&#x76EE;&#x524D;&#x8FD8;&#x4E0D;&#x6E05;&#x695A;&#x673A;&#x7406;&#xFF0C;&#x795E;&#x5947;.jpg)</p>
<p>&#x5BF9;&#x4E8E;TCP&#x548C;UDP&#x6765;&#x8BB2;&#xFF0C;&#x4ED6;&#x4EEC;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8D23;&#x4EFB;&#x662F;&#x5C06;IP&#x7684;&#x4F20;&#x9001;&#x670D;&#x52A1;&#x4ECE;system&#x5230;system&#x95F4;&#x63D0;&#x5347;&#x5230;process&#x5230;process&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x79CD;&#x63D0;&#x5347;&#x4F20;&#x8F93;&#x79F0;&#x4E3A;(de)multiplexing&#x3002;</p>
<h3 id="32-&#x591A;&#x8DEF;&#x590D;&#x7528;&#x548C;&#x89E3;&#x590D;&#x7528;"><a name="32-&#x591A;&#x8DEF;&#x590D;&#x7528;&#x548C;&#x89E3;&#x590D;&#x7528;" class="anchor-navigation-ex-anchor" href="#32-&#x591A;&#x8DEF;&#x590D;&#x7528;&#x548C;&#x89E3;&#x590D;&#x7528;"><i class="fa fa-link" aria-hidden="true"></i></a>3.2 &#x591A;&#x8DEF;&#x590D;&#x7528;&#x548C;&#x89E3;&#x590D;&#x7528;</h3>
<p>&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x6765;&#x8BF4;&#xFF0C;&#x591A;&#x8DEF;&#x590D;&#x7528;&#x548C;&#x89E3;&#x590D;&#x7528;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x4F60;&#x6709;&#x56DB;&#x4E2A;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x7684;&#x8FDB;&#x7A0B;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#xFF0C;&#x5F53;&#x4F60;&#x7535;&#x8111;&#x4E2D;&#x8FD0;&#x8F93;&#x5C42;&#x63A5;&#x53D7;&#x5230;&#x4E86;&#x6765;&#x81EA;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x6570;&#x540E;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x5C06;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x8FD0;&#x9001;&#x7ED9;&#x8FD9;&#x56DB;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x3002;</p>
<p><img src="IMG/3-2-1-transport_layer_multiplexing.PNG" alt=""></p>
<p>&#x6B63;&#x5982;&#x56FE;&#x4E2D;&#x6240;&#x793A;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x5728;&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x8FD0;&#x8F93;&#x5C42;&#x5E76;&#x4E0D;&#x76F4;&#x63A5;&#x628A;&#x6570;&#x636E;&#x4F20;&#x9001;&#x7ED9;&#x8FDB;&#x7A0B;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x5730;&#x662F;&#x4E00;&#x4E2A;&#x4E2D;&#x95F4;&#x7684;socket&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x8FD0;&#x8F93;&#x5C42;&#x7684;segment&#x90FD;&#x62E5;&#x6709;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x4F4D;&#x7528;&#x4EE5;&#x5B9E;&#x73B0;&#x590D;&#x7528;&#x548C;&#x89E3;&#x590D;&#x7528;&#x3002;&#x591A;&#x8DEF;&#x590D;&#x7528;&#x5C31;&#x662F;&#x6536;&#x96C6;&#x4E0D;&#x540C;socket&#x7684;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x628A;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5757;&#x548C;&#x5934;&#x90E8;&#x7684;&#x4FE1;&#x606F;(&#x989D;&#x5916;&#x6DFB;&#x52A0;&#x7684;)&#x6253;&#x5305;&#x53D1;&#x9001;&#x7ED9;&#x4E0B;&#x9762;&#x7684;&#x7F51;&#x7EDC;&#x5C42;&#x3002;</p>
<p>&#x591A;&#x8DEF;&#x590D;&#x7528;&#x9700;&#x8981;(1)socket&#x62E5;&#x6709;&#x552F;&#x4E00;&#x7684;&#x8BC6;&#x522B;&#x7B26;(2)&#x6BCF;&#x4E2A;&#x6BB5;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x4F4D;&#x7528;&#x6765;&#x544A;&#x8BC9;socket&#x53BB;&#x5411;&#x8C01;&#x8FD0;&#x8F93;&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x6E90;&#x7AEF;&#x53E3;&#x53F7;&#x548C;&#x76EE;&#x7684;&#x5730;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#x3002;0&#x5230;1023&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#x662F;&#x4E00;&#x4E9B;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4E00;&#x822C;&#x6211;&#x4EEC;&#x5206;&#x914D;port&#x7684;&#x65F6;&#x5019;&#x907F;&#x5F00;&#x4ED6;&#x4EEC;(RFC1700)&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;UDP socket&#x662F;&#x53EF;&#x4EE5;&#x88AB;&#x4E00;&#x7EC4;(&#x76EE;&#x6807;IP&#x5730;&#x5740;, &#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x53F7;)&#x6240;&#x5B8C;&#x5168;&#x8BC6;&#x522B;&#x7684;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x5982;&#x679C;&#x4E24;&#x4E2A;UDP&#x6BB5;&#x62E5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x6E90;IP&#x5730;&#x5740;&#x6216;&#x8005;&#x4E0D;&#x540C;&#x7684;&#x6E90;&#x7AEF;&#x53E3;&#xFF0C;&#x4F46;&#x62E5;&#x6709;&#x76F8;&#x540C;&#x7684;&#x76EE;&#x6807;IP&#x548C;&#x7AEF;&#x53E3;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x6BB5;&#x5C06;&#x4F1A;&#x88AB;&#x76F4;&#x63A5;&#x8FD0;&#x5F80;&#x5230;&#x76F8;&#x540C;&#x7684;&#x76EE;&#x6807;&#x8FDB;&#x7A0B;(&#x4E5F;&#x662F;&#x901A;&#x8FC7;&#x76F8;&#x540C;&#x7684;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684;socket)</p>
<blockquote>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6E90;&#x5904;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#x8D77;&#x5230;&#x4E00;&#x4E2A;&#x8FD4;&#x56DE;&#x5730;&#x5740;&#x7684;&#x4F5C;&#x7528;</p>
</blockquote>
<p>&#x800C;&#x5BF9;&#x4E8E;TCP&#x7684;socket&#x6765;&#x8BF4;&#xFF0C;&#x5B8C;&#x5168;&#x51B3;&#x5B9A;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x56DB;&#x5143;&#x7EC4;(&#x6E90;IP&#x5730;&#x5740;&#xFF0C;&#x6E90;&#x7AEF;&#x53E3;&#xFF0C;&#x76EE;&#x6807;IP&#x5730;&#x5740;&#xFF0C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;);&#x56E0;&#x800C;&#x82E5;&#x4E24;&#x4E2A;TCP&#x6BB5;&#x62E5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x6E90;IP&#x5730;&#x5740;&#x6216;&#x6E90;&#x7AEF;&#x53E3;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x4F1A;&#x88AB;&#x5F15;&#x5BFC;&#x81F3;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;socket&#x4E0A;&#x3002;&#x4E0B;&#x56FE;&#x4F8B;&#x5B50;&#x7ED9;&#x51FA;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x89E3;&#x91CA;&#x3002;</p>
<p><img src="IMG/3-2-2-TCP_socket.PNG" alt=""></p>
<p>&#x5BF9;&#x4E8E;webserver&#x6765;&#x8BF4;&#xFF0C;&#x5728;socket&#x548C;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x4E5F;&#x4E0D;&#x662F;&#x4E00;&#x5BF9;&#x4E00;&#x7684;&#xFF0C;&#x4ECA;&#x65E5;&#x7684;&#x9AD8;&#x6027;&#x80FD;&#x7684;Web&#x670D;&#x52A1;&#x5668;&#x4E00;&#x822C;&#x4F1A;&#x4E3A;&#x6BCF;&#x4E2A;&#x65B0;&#x7684;&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x3002;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x4E0D;&#x8FDE;&#x7EED;&#x8FDE;&#x63A5;&#x7684;HTTP&#x6765;&#x8BB2;&#xFF0C;&#x4F9D;&#x7136;&#x4F1A;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#x5E26;&#x6765;&#x4E0D;&#x5C0F;&#x7684;&#x8D1F;&#x62C5;&#x3002;</p>
<h3 id="33-&#x62E5;&#x6709;&#x5C11;&#x8FDE;&#x63A5;&#x7684;&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;udp"><a name="33-&#x62E5;&#x6709;&#x5C11;&#x8FDE;&#x63A5;&#x7684;&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;udp" class="anchor-navigation-ex-anchor" href="#33-&#x62E5;&#x6709;&#x5C11;&#x8FDE;&#x63A5;&#x7684;&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;udp"><i class="fa fa-link" aria-hidden="true"></i></a>3.3 &#x62E5;&#x6709;&#x5C11;&#x8FDE;&#x63A5;&#x7684;&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;:UDP</h3>
<p>&#x5982;&#x679C;&#x5E94;&#x7528;&#x9009;&#x62E9;&#x4E86;UDP&#x4F5C;&#x4E3A;&#x8FD0;&#x8F93;&#x5C42;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x7528;&#x51E0;&#x4E4E;&#x662F;&#x76F4;&#x63A5;&#x5730;&#x4E0E;IP&#x5BF9;&#x8BDD;&#x3002;UDP&#x5728;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x53D7;&#x8FD0;&#x8F93;&#x5C42;&#x5B9E;&#x4F53;&#x524D;&#x5E76;&#x6CA1;&#x6709;&#x63E1;&#x624B;&#xFF0C;&#x56E0;&#x800C;UDP&#x88AB;&#x79F0;&#x4E4B;&#x4E3A;connectionless&#x3002;</p>
<p>DNS&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x4F7F;&#x7528;UDP&#x7684;&#x5E94;&#x7528;&#x5C42;&#x534F;&#x8BAE;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;TCP&#x800C;&#x8A00;&#xFF0C;UDP&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x8FD9;&#x4E9B;&#x4F18;&#x70B9;&#x3002;</p>
<ul>
<li><p>&#x66F4;&#x597D;&#x7684;&#x63A7;&#x5236;&#x4EC0;&#x4E48;&#x6570;&#x636E;&#x4F20;&#x8F93;&#xFF0C;&#x4EE5;&#x53CA;&#x4EC0;&#x4E48;&#x65F6;&#x95F4;&#xFF0C;&#x5BF9;&#x4E8E;UDP&#x800C;&#x8A00;&#xFF0C;&#x5F53;&#x5E94;&#x7528;&#x8FDB;&#x7A0B;&#x4E00;&#x628A;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7ED9;UDP&#x65F6;&#xFF0C;UDP&#x5C31;&#x4F1A;&#x628A;&#x4ED6;&#x4EEC;&#x6253;&#x5305;&#x6210;UDP&#x7684;&#x6BB5;&#x5E76;&#x4E14;&#x8FC5;&#x901F;&#x7684;&#x628A;&#x8FD9;&#x4E9B;&#x6BB5;&#x4F20;&#x9012;&#x5230;&#x7F51;&#x7EDC;&#x5C42;&#x3002;TCP&#xFF0C;&#x62E5;&#x6709;&#x963B;&#x585E;&#x5904;&#x7406;&#x7684;&#x673A;&#x5236;&#x3002;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x5B9E;&#x65F6;&#x7684;&#x5E94;&#x7528;&#x800C;&#x8A00;&#xFF0C;&#x901A;&#x5E38;&#x90FD;&#x8981;&#x6C42;&#x4E00;&#x4E2A;&#x6700;&#x5C0F;&#x7684;&#x4F20;&#x8F93;&#x901F;&#x7387;&#xFF0C;&#x5E76;&#x4E0D;&#x60F3;&#x5EF6;&#x65F6;&#x4EFB;&#x4F55;&#x7684;&#x4F20;&#x9001;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x4E22;&#x5931;&#xFF0C;&#x90A3;&#x4E48;TCP&#x5C31;&#x4E0D;&#x662F;&#x5F88;&#x9002;&#x5408;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x4E86;&#x3002;</p>
</li>
<li><p>&#x4E0D;&#x9700;&#x8981;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x3002;TCP&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x5728;&#x4F20;&#x8F93;&#x771F;&#x6B63;&#x7684;&#x6570;&#x636E;&#x4E4B;&#x524D;&#x3002;HTTP&#x4F7F;&#x7528;&#x7684;&#x662F;TCP&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x4F60;&#x4E0B;&#x8F7D;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x603B;&#x5E0C;&#x671B;&#x4ED6;&#x4EEC;&#x662F;&#x53EF;&#x9760;&#x7684;&#x3002;&#x4E0D;&#x8FC7;QUIC&#x534F;&#x8BAE;(Quick UDP Internet Connection),&#x5728;Chrome&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x5C31;&#x662F;&#x7528;&#x7684;UDP&#x4F5C;&#x4E3A;&#x8FD0;&#x8F93;&#x5C42;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x5E76;&#x4E14;&#x5B9E;&#x73B0;&#x4E86;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x53EF;&#x9760;&#x63A7;&#x5236;&#x3002;</p>
</li>
<li><p>&#x66F4;&#x5C0F;&#x7684;&#x5934;&#x90E8;&#xFF0C;UDP&#x9700;&#x8981;8&#x4E2A;&#x5B57;&#x8282;: 2&#x5B57;&#x8282;&#x81EA;&#x5DF1;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;2&#x5B57;&#x8282;&#x76EE;&#x6807;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;2&#x5B57;&#x8282;&#x957F;&#x5EA6;&#xFF0C;2&#x5B57;&#x8282;&#x6821;&#x9A8C;&#x7801;;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;TCP&#x9700;&#x8981;&#x7528;&#x5230;20&#x4E2A;&#x5B57;&#x8282;&#x3002;</p>
</li>
</ul>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5373;&#x4F7F;&#x4F7F;&#x7528;UDP&#x4F5C;&#x4E3A;&#x8FD0;&#x8F93;&#x5C42;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x5728;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x89D2;&#x5EA6;&#x4E0A;&#x4FDD;&#x8BC1;&#x4F20;&#x8F93;&#x53EF;&#x9760;&#x4E5F;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x5728;&#x5E94;&#x7528;&#x5C42;&#x4E0A;&#x52A0;&#x5165;&#x786E;&#x8BA4;&#x548C;&#x91CD;&#x65B0;&#x4F20;&#x8F93;&#x7684;&#x673A;&#x5236;&#x3002;QUIC&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x90A3;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;trivial&#x7684;&#x5DE5;&#x4F5C;:)</p>
<p>UDP&#x4F7F;&#x7528;1&#x8865;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x524D;&#x4E24;&#x4E2A;2&#x5B57;&#x8282;&#x76F8;&#x52A0;&#x5F97;&#x5230;&#x4E00;&#x4E2A;16bit&#x7684;&#x6570;&#x636E;&#xFF0C;&#x518D;&#x548C;&#x7B2C;&#x4E09;&#x4E2A;&#x5B57;&#x8282;&#x76F8;&#x52A0;&#xFF0C;&#x53D6;&#x53CD;&#x5C31;&#x662F;&#x6821;&#x9A8C;&#x7801;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#x65F6;&#x5019;&#x628A;&#x4ED6;&#x4EEC;&#x90FD;&#x76F8;&#x52A0;&#x5C31;&#x662F;1111...&#x4E86;&#x3002;</p>
<p>UDP&#x4E4B;&#x6240;&#x4EE5;&#x63D0;&#x4F9B;&#x8FD9;&#x79CD;&#x6821;&#x9A8C;&#x7801;&#x7684;&#x76EE;&#x7684;&#x5728;&#x4E8E;&#x4E0D;&#x4E00;&#x5B9A;&#x6240;&#x6709;&#x7684;&#x94FE;&#x8DEF;&#x4E4B;&#x95F4;&#x90FD;&#x6709;&#x68C0;&#x67E5;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x751A;&#x81F3;&#x5373;&#x4F7F;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x88AB;&#x6B63;&#x786E;&#x7684;&#x4F20;&#x9001;&#x5230;&#x4E86;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#xFF0C;&#x90A3;&#x4E48;&#x5728;router&#x91CC;&#x9762;&#x8F6C;&#x79FB;&#x5B58;&#x50A8;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E5F;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x7684;&#x3002;&#x867D;&#x7136;UDP&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x6837;&#x68C0;&#x9519;&#x7801;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x4E0D;&#x8FC7;&#x4ED6;&#x5E76;&#x4E0D;&#x63D0;&#x4F9B;&#x6062;&#x590D;&#x9519;&#x8BEF;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4E00;&#x4E9B;UDP&#x7684;&#x5B9E;&#x73B0;&#x76F4;&#x63A5;&#x7B80;&#x5355;&#x5730;&#x820D;&#x5F03;&#x4E86;&#x90A3;&#x4E9B;&#x635F;&#x574F;&#x7684;&#x6BB5;&#xFF0C;&#x53E6;&#x4E00;&#x4E9B;&#x5219;&#x628A;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x7684;&#x6BB5;&#x6807;&#x8BB0;&#x4E3A;&#x8B66;&#x544A;&#x3002;</p>
<h3 id="34-&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x51C6;&#x5219;&#x91CD;&#x8981;"><a name="34-&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x51C6;&#x5219;&#x91CD;&#x8981;" class="anchor-navigation-ex-anchor" href="#34-&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x51C6;&#x5219;&#x91CD;&#x8981;"><i class="fa fa-link" aria-hidden="true"></i></a>3.4 &#x53EF;&#x9760;&#x4F20;&#x8F93;&#x51C6;&#x5219;(&#x91CD;&#x8981;)</h3>
<p>&#x8FD9;&#x90E8;&#x5206;&#x662F;&#x7CBE;&#x534E;&#x554A;&#xFF0C;&#x8BA4;&#x771F;&#x770B;&#x4E66;,&#x51B3;&#x5B9A;&#x7FFB;&#x8BD1;&#x5168;&#x6587;!</p>
<p>&#x5728;&#x8FD9;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x5C42;&#x9762;&#x8003;&#x8651;&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5B9E;&#x73B0;&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x4E0D;&#x4EC5;&#x51FA;&#x73B0;&#x5728;&#x8FD0;&#x8F93;&#x5C42;&#xFF0C;&#x5E76;&#x4E14;&#x518D;&#x94FE;&#x8DEF;&#x5C42;&#x548C;&#x5E94;&#x7528;&#x5C42;&#x4E5F;&#x4F1A;&#x7528;&#x5230;&#x3002;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#x4E0A;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<pre><code>
+------------------------------------------------------------------+
|                      APPLICATION LAYER                           |
|    Sending process                       Receiver process        |
|          &#x2193;                                    &#x2191;                  |
|          |                                    |                  |
+----------|------------------------------------|------------------+
|          |           TRANSPORT LAYER          |                  |
|           \       +-----------------+        /                   |
|            ------&gt;| Reliable Channel|-------&gt;                    |
|                   +-----------------+                            |
+------------------------------------------------------------------+
</code></pre><p>&#x4E0A;&#x9762;&#x8BF4;&#x660E;&#x4E86;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x5B66;&#x4E60;&#x5230;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x7684;&#x6846;&#x67B6;&#x3002;&#x8FD9;&#x79CD;&#x62BD;&#x8C61;&#x7684;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x7ED9;&#x4E86;&#x66F4;&#x9AD8;layer&#x7684;&#x53EF;&#x9760;&#x4FDD;&#x8BC1;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x4FE1;&#x9053;&#x800C;&#x8A00;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;bit&#x4F1A;&#x51FA;&#x73B0;&#x7FFB;&#x8F6C;&#x7684;&#x95EE;&#x9898;&#x6216;&#x8005;&#x5BF9;&#x89C6;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x4F20;&#x9012;&#x3002;&#x8FD9;&#x79CD;&#x670D;&#x52A1;&#x4E5F;&#x6070;&#x5DE7;&#x662F;TCP&#x6240;&#x80FD;&#x63D0;&#x4F9B;&#x7684;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x670D;&#x52A1;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x4E9B;&#x518D;&#x53EF;&#x9760;&#x7684;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#x4E0B;&#x9762;&#x7684;&#x534F;&#x8BAE;&#x53EF;&#x80FD;&#x5E76;&#x975E;&#x662F;&#x53EF;&#x9760;&#x7684;&#x3002;&#x6BD4;&#x5982;TCP&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#xFF0C;&#x4F46;&#x662F;IP&#x5C31;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x534F;&#x8BAE;&#x3002;</p>
<p>&#x8FD9;&#x8FD9;&#x4E2A;&#x5C0F;&#x7AE0;&#x8282;&#x91CC;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x9010;&#x6E10;&#x5730;&#x5F00;&#x53D1;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x8FD0;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#xFF0C;&#x5E76;&#x4E14;&#x9010;&#x6E10;&#x589E;&#x52A0;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8003;&#x8651;&#x5F53;&#x4FE1;&#x9053;&#x4F1A;&#x6709;&#x8BEF;&#x7801;&#x6216;&#x8005;&#x4E22;&#x5931;&#x6574;&#x4E2A;&#x5305;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9700;&#x8981;&#x54EA;&#x79CD;&#x673A;&#x5236;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x5B9A;&#x5305;&#x5C06;&#x4F1A;&#x88AB;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x8FD0;&#x8F93;&#x81F3;&#x76EE;&#x7684;&#x5730;&#xFF0C;&#x5C3D;&#x7BA1;&#x4E00;&#x4E9B;&#x5305;&#x53EF;&#x80FD;&#x4E22;&#x6389;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5305;&#x7ECF;&#x8FC7;&#x4FE1;&#x9053;&#x540E;&#x5E76;&#x4E0D;&#x4F1A;&#x6709;&#x9519;&#x8BEF;&#x7684;&#x987A;&#x5E8F;&#x3002;</p>
<pre><code>+------------|----------------------------------|------------------+
|            |        TRANSPORT LAYER           &#x2191;                  |
|  rdt_send()&#x2193;                    deliver_data()|                  |
|  +------------------+                +------------------+        |
|  | Reliable data    |                | Reliable data    |        |
|  | transfer protocol|                | transfer protocol|        |
|  | (sending side)   |                | (receiving side) |        |
|  +------------------+                +------------------+        |
|            &#x2191;                         rdt_rcv()&#x2191;                 |
|  udt_send()&#x2193;                                  &#x2193;                 |
+------------|-----------------------------------------------------+
|            |                                  |                 |
|            \       +-----------------+       /                  |
|            ------&gt;| Reliable Channel|-------&gt;                    |
|                   +-----------------+                            |
|                                                                  |
+------------------------------------------------------------------+
</code></pre><p>&#x5982;&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x56FE;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x90A3;&#x6837;,&#x8FD0;&#x8F93;&#x5C42;&#x7684;&#x53D1;&#x9001;&#x7AEF;&#x5C06;&#x4F1A;&#x88AB;&#x4E00;&#x4E2A;&#x53EB;<code>rdt_send</code>&#x7684;&#x51FD;&#x6570;&#x89E6;&#x53D1;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5C06;&#x4F1A;&#x628A;&#x66F4;&#x9AD8;&#x5C42;&#x7684;&#x6570;&#x636E;&#x53D1;&#x9001;&#x8FC7;&#x6765;&#xFF0C;(rdt &#x4EE3;&#x8868; reliable data transfer) ;&#x5728;&#x63A5;&#x6536;&#x7AEF;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5305;&#x4F20;&#x9001;&#x5230;&#x76EE;&#x7684;&#x5730;<code>rdt_rcv</code>&#x4F1A;&#x88AB;&#x8C03;&#x7528;,&#x7136;&#x540E;&#x4E3A;&#x4E86;&#x628A;&#x6570;&#x636E;&#x7EE7;&#x7EED;&#x4F20;&#x9001;&#x7ED9;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x8C03;&#x7528;<code>deliver_data</code>&#x3002;&#x4E3A;&#x4E86;&#x4EA4;&#x6362;packet&#x7ED9;&#x66F4;&#x9AD8;&#x6216;&#x66F4;&#x4F4E;&#x7684;&#x5C42;&#x6B21;&#xFF0C;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x7AEF;&#x7ED9;&#x53E6;&#x4E00;&#x7AEF;&#x53D1;&#x9001;&#x5305;&#x662F;&#x4F7F;&#x7528;<code>udt_send</code>(unreliable data transfer)&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x9010;&#x6E10;&#x6DF1;&#x5165;&#x4E00;&#x4E9B;&#x534F;&#x8BAE;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x4F1A;&#x9010;&#x6E10;&#x53D8;&#x5F97;&#x590D;&#x6742;&#x8D77;&#x6765;</p>
<h4 id="&#x7406;&#x60F3;&#x4FE1;&#x9053;&#x4E0B;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;-rdt10"><a name="&#x7406;&#x60F3;&#x4FE1;&#x9053;&#x4E0B;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;-rdt10" class="anchor-navigation-ex-anchor" href="#&#x7406;&#x60F3;&#x4FE1;&#x9053;&#x4E0B;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;-rdt10"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7406;&#x60F3;&#x4FE1;&#x9053;&#x4E0B;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93; rdt1.0</h4>
<p>&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8003;&#x8651;&#x6700;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5176;&#x4E0B;&#x9762;&#x7684;&#x4FE1;&#x9053;&#x662F;&#x5B8C;&#x5168;&#x53EF;&#x9760;&#x7684;&#x3002;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x7684;&#x534F;&#x8BAE;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;rdt1.0&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x666E;&#x901A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x4ED6;&#x7684;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x5982;&#x4E0B;:</p>
<p><img src="IMG/3-4-3-rdt1_0.PNG" alt=""></p>
<p>&#x7531;&#x4E8E;&#x5B83;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x770B;&#x56FE;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x90FD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x72B6;&#x6001;(&#x5E76;&#x4E14;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5047;&#x5B9A;&#x4E86;&#x63A5;&#x6536;&#x7AEF;&#x53EF;&#x4EE5;&#x8FC5;&#x901F;&#x5730;&#x63A5;&#x6536;&#x53D1;&#x9001;&#x7AEF;&#x7684;&#x4FE1;&#x606F;)&#x3002;</p>
<h4 id="&#x4FE1;&#x9053;&#x6709;&#x8BEF;&#x7801;&#x4E0B;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;-rdt20"><a name="&#x4FE1;&#x9053;&#x6709;&#x8BEF;&#x7801;&#x4E0B;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;-rdt20" class="anchor-navigation-ex-anchor" href="#&#x4FE1;&#x9053;&#x6709;&#x8BEF;&#x7801;&#x4E0B;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;-rdt20"><i class="fa fa-link" aria-hidden="true"></i></a>&#x4FE1;&#x9053;&#x6709;&#x8BEF;&#x7801;&#x4E0B;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93; rdt2.0</h4>
<p>&#x4E00;&#x4E2A;&#x66F4;&#x8D34;&#x8FD1;&#x771F;&#x5B9E;&#x60C5;&#x51B5;&#x7684;&#x573A;&#x666F;&#x662F;packet&#x4E2D;&#x7684;&#x67D0;&#x4E9B;bit&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x3002;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#x5728;&#x5F53;&#x4ECA;&#x7684;&#x7F51;&#x7EDC;&#x4E0B;&#x8FD8;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5728;packet&#x4F20;&#x9012;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6216;&#x8005;buffer&#x7684;&#x65F6;&#x5019;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x5C06;&#x5047;&#x5B9A;&#x63A5;&#x6536;&#x7684;&#x5305;&#x662F;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x7684;&#x3002;</p>
<p>&#x5728;&#x7740;&#x624B;&#x5F00;&#x5C55;&#x65B0;&#x7684;&#x534F;&#x8BAE;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8003;&#x8651;&#x4EBA;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x5E94;&#x5BF9;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x7ECF;&#x5178;&#x7684;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x7684;&#x4EBA;&#x4F1A;&#x8BF4;&quot;&#x597D;&#x7684;&quot;&#x6765;&#x786E;&#x4FDD;&#x5F53;&#x524D;&#x7684;&#x8BDD;&#x542C;&#x61C2;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x6CA1;&#x6709;&#x542C;&#x61C2;&#xFF0C;&#x4ED6;&#x4F1A;&#x5411;&#x4F60;&#x518D;&#x8BE2;&#x95EE;&#xFF0C;&#x53D1;&#x51FA;&#x6CA1;&#x542C;&#x61C2;&#x7684;&#x610F;&#x601D;&#x6BD4;&#x5982;&quot;&#x4F60;&#x8BF4;&#x4EC0;&#x4E48;&quot;&#x3002;&#x8FD9;&#x79CD;&#x534F;&#x8BAE;&#x4F7F;&#x7528;&#x4E86;&#x79EF;&#x6781;&#x8BA4;&#x53EF;(&quot;OK&quot;)&#x548C;&#x6D88;&#x6781;&#x8BA4;&#x53EF;(&quot;Please repeat&quot;)&#x3002;&#x8FD9;&#x79CD;&#x63A7;&#x5236;&#x6D88;&#x606F;&#x4F7F;&#x5F97;&#x63A5;&#x6536;&#x8005;&#x53EF;&#x4EE5;&#x8BA9;&#x53D1;&#x9001;&#x8005;&#x76F4;&#x5230;&#x5F53;&#x524D;&#x7684;&#x6D88;&#x606F;&#x662F;&#x5426;&#x88AB;&#x6B63;&#x786E;&#x63A5;&#x6536;&#x4E86;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x8BA9;&#x53D1;&#x9001;&#x8005;&#x76F4;&#x5230;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x4E00;&#x904D;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x4F9D;&#x8D56;&#x4E8E;&#x91CD;&#x4F20;&#x7684;&#x673A;&#x5236;&#x79F0;&#x4E3A;ARQ(Automatic Repeat reQuest) protocols&#x3002;</p>
<p>&#x5728;ARQ&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4EE5;&#x4E0B;&#x529F;&#x80FD;: &#x9519;&#x8BEF;&#x68C0;&#x6D4B;&#xFF0C;&#x63A5;&#x6536;&#x8005;&#x53CD;&#x9988;&#xFF0C;&#x91CD;&#x4F20;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x5728;&#x5DE6;&#x4FA7;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53D1;&#x9001;&#x7AEF;&#x7B49;&#x5F85;&#x9AD8;&#x5C42;&#x6570;&#x636E;&#x4F20;&#x8F93;&#xFF0C;&#x7136;&#x540E;rdt2.0&#x4F1A;&#x628A;&#x8FD9;&#x4E2A;&#x5305;&#x52A0;&#x5165;&#x6821;&#x9A8C;&#x7801;&#x53D1;&#x7ED9;&#x63A5;&#x6536;&#x7AEF;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x662F;NAK(&#x4EE3;&#x8868;&#x6709;&#x9519;&#x8BEF;)&#x5C31;&#x7EE7;&#x7EED;&#x53D1;&#x9001;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x9519;&#x8BEF;&#x5C31;&#x8FD4;&#x56DE;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x7B49;&#x5F85;&#x9AD8;&#x5C42;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x65B0;&#x7684;&#x6570;&#x636E;&#x3002;&#x63A5;&#x6536;&#x7AEF;&#x5219;&#x662F;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x6709;&#x9519;&#x5C31;&#x8FD4;&#x56DE;NAK&#xFF0C;&#x7EE7;&#x7EED;&#x7B49;&#x5F85;&#xFF1B;&#x5982;&#x679C;&#x6CA1;&#x9519;&#x5C31;&#x628A;&#x6570;&#x636E;&#x4F20;&#x7ED9;&#x66F4;&#x9AD8;&#x5C42;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;ACK&#x4FE1;&#x53F7;&#x3002;&#x56E0;&#x4E3A;&#x53D1;&#x9001;&#x7AEF;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x63A5;&#x6536;&#x4FE1;&#x53F7;&#x786E;&#x8BA4;&#x624D;&#x4F1A;&#x53D1;&#x9001;&#x4E0B;&#x4E00;&#x4E2A;&#xFF0C;&#x8FD9;&#x79CD;&#x534F;&#x8BAE;&#x4E5F;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A;stop-and-wait&#x534F;&#x8BAE;&#x3002;&#x4F46;&#x8FD9;&#x79CD;&#x534F;&#x8BAE;&#x5BF9;&#x4FE1;&#x9053;&#x7684;&#x5229;&#x7528;&#x7387;&#x5F88;&#x4F4E;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;ACK&#x6216;&#x8005;NAK&#x6709;&#x9519;&#x8BEF;&#x7684;&#x8BDD;&#x5C31;&#x4F1A;&#x6709;&#x95EE;&#x9898;&#x3002;</p>
<p><img src="IMG/3-4-3-rdt1_0.PNG" alt=""></p>
<p>&#x89E3;&#x51B3;ACK/NAK&#x9519;&#x8BEF;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x63A5;&#x5165;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x68C0;&#x6D4B;&#x4F4D;,&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x65E0;&#x8BBA;&#x63A5;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x7684;ACK&#x8FD8;&#x662F;NAK&#xFF0C;&#x90FD;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x96BE;&#x70B9;&#x5728;&#x4E8E;&#x63A5;&#x6536;&#x7AEF;&#x4E0D;&#x77E5;&#x9053;&#x4E0A;&#x4E2A;ACK&#x6216;&#x8005;NAK&#x4FE1;&#x53F7;&#x6709;&#x6CA1;&#x6709;&#x88AB;&#x53D1;&#x9001;&#x65AD;&#x6B63;&#x786E;&#x63A5;&#x53D7;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4E8B;&#x5148;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x5C06;&#x8981;&#x5230;&#x6765;&#x7684;&#x5305;&#x662F;&#x65B0;&#x6570;&#x636E;&#x8FD8;&#x662F;&#x91CD;&#x4F20;&#x7684;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;sequence number&#x3002;&#x8FD9;&#x6837;&#x63A5;&#x6536;&#x7AEF;&#x53EA;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x8FD9;&#x4E2A;&#x5E8F;&#x5217;&#x53F7;&#x5C31;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x6536;&#x5230;&#x7684;&#x5305;&#x662F;&#x5426;&#x662F;&#x91CD;&#x4F20;&#x7684;&#x4E86;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;stop-and-wait&#x534F;&#x8BAE;&#x6765;&#x8BB2;&#xFF0C;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x53F7;&#x5C31;&#x8DB3;&#x591F;&#x3002;&#x63A5;&#x6536;&#x7AEF;&#x4F1A;&#x628A;&#x6700;&#x8FD1;&#x63A5;&#x6536;&#x5230;&#x6B63;&#x786E;&#x7684;sequence number&#x53D1;&#x9001;&#x56DE;&#x53D1;&#x9001;&#x7AEF;&#xFF0C;&#x53D1;&#x9001;&#x7AEF;&#x53EA;&#x8981;&#x6BD4;&#x8F83;&#x5E8F;&#x5217;&#x53F7;&#x662F;&#x5426;&#x4E00;&#x81F4;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<p>&#x53D1;&#x9001;&#x7AEF;&#x7684;&#x72B6;&#x6001;&#x5982;&#x4E0B;&#xFF1A;1. &#x53D1;&#x9001;&#x7AEF;&#x9AD8;&#x5C42;layer&#x7684;&#x53D1;&#x9001;&#xFF0C;&#x6574;&#x7406;&#x6570;&#x636E;&#x6DFB;&#x52A0;checksum&#xFF0C;&#x5E76;&#x6DFB;&#x52A0;&#x5E8F;&#x5217;&#x53F7;&#x4E3A;0&#xFF0C;&#x53D1;&#x9001;&#x7ED9;&#x63A5;&#x6536;&#x7AEF;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x6536;&#x5230;&#x4FE1;&#x53F7;&#x540E;&#x5982;&#x679C;&#x6709;&#x95EE;&#x9898;&#x5C31;&#x4F1A;&#x8981;&#x6C42;&#x91CD;&#x4F20;(&#x5982;&#x679C;seq number &#x6709;&#x95EE;&#x9898;&#x4E5F;&#x662F;) 2.&#x7ECF;&#x8FC7;&#x82E5;&#x5E72;&#x6B21;&#x91CD;&#x4F20;&#x6216;&#x8005;&#x76F4;&#x63A5;ok&#xFF0C;&#x8DF3;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x65F6;&#x53D1;&#x9001;&#x7AEF;&#x53D1;&#x9001;&#x5E8F;&#x5217;&#x53F7;&#x4E3A;1&#x7684;&#x5305;&#xFF0C;&#x5982;&#x679C;&#x63A5;&#x6536;&#x7AEF;&#x53D1;&#x73B0;&#x5E8F;&#x5217;&#x53F7;&#x9519;&#x8BEF;&#x6216;&#x8005;&#x5305;&#x9519;&#x8BEF;&#xFF0C;&#x8FD8;&#x662F;&#x6309;&#x7167;&#x8981;&#x6C42;&#x91CD;&#x4F20;&#x3002;</p>
<p>&#x53D6;&#x4EE3;&#x53D1;&#x9001;NAK&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x6700;&#x8FD1;&#x7684;&#x6B63;&#x786E;&#x5305;&#x7684;ACK&#xFF0C;&#x8FD9;&#x6709;&#x76F8;&#x540C;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x9001;&#x8005;&#x53D1;&#x73B0;&#x6709;&#x4E24;&#x4E2A;&#x76F8;&#x540C;&#x7684;&#x5305;&#x88AB;&#x63A5;&#x53D7;&#xFF0C;&#x5C31;&#x8BF4;&#x660E;&#x51FA;&#x73B0;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x50CF;rdt2.2&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="IMG/3-4-4-rdt2_2.PNG" alt=""></p>
<p>&#x5728;rdt2.2&#x4E2D;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;NAK&#x4FE1;&#x53F7;&#x4E86;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#x5982;&#x679C;&#x5F53;&#x524D;&#x53D1;&#x9001;&#x7684;&#x662F;&#x5E8F;&#x5217;0&#xFF0C;&#x6211;&#x5C31;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;1&#xFF0C;&#x8FD9;&#x6837;&#x53D1;&#x9001;&#x7AEF;&#x5C31;&#x77E5;&#x9053;&#x53D1;&#x9001;&#x7684;&#x90A3;&#x4E2A;&#x5305;&#x51FA;&#x73B0;&#x4E86;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="&#x5728;&#x4E22;&#x5305;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;-rdt30"><a name="&#x5728;&#x4E22;&#x5305;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;-rdt30" class="anchor-navigation-ex-anchor" href="#&#x5728;&#x4E22;&#x5305;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93;-rdt30"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5728;&#x4E22;&#x5305;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x8F93; rdt3.0</h4>
<p>&#x5728;&#x5F53;&#x4ECA;&#x7684;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x4E22;&#x5305;&#x5176;&#x5B9E;&#x662F;&#x7ECF;&#x5E38;&#x53D1;&#x751F;&#x7684;&#xFF0C;&#x4E24;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x8003;&#x8651;&#x5FC5;&#x987B;&#x589E;&#x52A0;&#xFF1A;1.&#x5982;&#x679C;&#x68C0;&#x6D4B;&#x5305;&#x4E22;&#x5931; 2.&#x5F53;&#x5305;&#x4E22;&#x5931;&#x65F6;&#x9700;&#x8981;&#x505A;&#x4EC0;&#x4E48; &#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5148;&#x628A;&#x68C0;&#x6D4B;&#x548C;&#x6062;&#x590D;&#x7684;&#x4EFB;&#x52A1;&#x653E;&#x5230;&#x53D1;&#x9001;&#x7AEF;&#x3002;&#x5047;&#x5B9A;&#x53D1;&#x9001;&#x8005;&#x53D1;&#x9001;&#x7684;&#x90A3;&#x4E2A;&#x5305;&#x6216;&#x8005;&#x63A5;&#x53D7;&#x8005;&#x5BF9;&#x90A3;&#x4E2A;&#x5305;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x4E22;&#x6389;&#x4E86;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53D1;&#x9001;&#x7AEF;&#x5C06;&#x4E0D;&#x4F1A;&#x63A5;&#x6536;&#x5230;&#x6765;&#x81EA;&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x56DE;&#x5E94;&#x3002;&#x5982;&#x679C;&#x53D1;&#x9001;&#x7AEF;&#x7B49;&#x5F85;&#x7684;&#x65F6;&#x95F4;&#x8DB3;&#x591F;&#x957F;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x53D1;&#x9001;&#x7AEF;&#x5C31;&#x786E;&#x4FE1;&#xFF0C;&#x8FD9;&#x4E2A;&#x5305;&#x4E22;&#x5931;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x91CD;&#x4F20;&#x3002;&#x4F46;&#x662F;&#x7A76;&#x7ADF;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x5176;&#x5B9E;&#x5F88;&#x96BE;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x5305;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x80FD;&#x7ECF;&#x8FC7;&#x5F88;&#x5927;&#x7684;&#x5EF6;&#x65F6;&#xFF0C;&#x6240;&#x4EE5;&#x53D1;&#x9001;&#x7AEF;&#x53EF;&#x80FD;&#x4F1A;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x76F8;&#x540C;&#x7684;&#x8BF7;&#x6C42;&#x5373;&#x4F7F;&#x8FD9;&#x4E2A;&#x5305;&#x548C;ACK&#x6CA1;&#x6709;&#x4E22;&#x5931;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x91CD;&#x590D;&#x6570;&#x636E;&#x5305;&#x4F1A;&#x88AB;&#x53D1;&#x9001;&#x5230;&#x4FE1;&#x9053;&#x4E2D;&#xFF0C;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x5728;rdt2.2&#x4E2D;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x5E8F;&#x5217;&#x53F7;&#x5B9E;&#x73B0;&#x4E86;&#x76F8;&#x5173;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x4ECE;&#x53D1;&#x9001;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BB2;&#xFF0C;&#x91CD;&#x4F20;&#x662F;&#x4E00;&#x4E2A;&#x4E07;&#x80FD;&#x836F;&#xFF0C;&#x53D1;&#x9001;&#x8005;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x6570;&#x636E;&#x5305;&#x662F;&#x5426;&#x4E22;&#x5931;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x4E2A;ACK&#x4E22;&#x5931;&#x3002;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x65F6;&#x95F4;&#x7684;&#x91CD;&#x4F20;&#x673A;&#x5236;&#x9700;&#x8981;&#x5B9A;&#x65F6;&#x5668;&#x6765;&#x6253;&#x65AD;&#x53D1;&#x9001;&#x8005;&#x3002;&#x56E0;&#x800C;&#x53D1;&#x9001;&#x8005;&#x9700;&#x8981;1.&#x5728;&#x6BCF;&#x4E2A;&#x5305;(&#x65E0;&#x8BBA;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x8FD8;&#x662F;&#x91CD;&#x4F20;)&#x53D1;&#x9001;&#x7684;&#x65F6;&#x5019;&#x5F00;&#x542F;&#x4E00;&#x4E2A;timer&#xFF0C;2.&#x54CD;&#x5E94;&#x65F6;&#x949F;&#x4E2D;&#x65AD;3.&#x505C;&#x6B62;&#x5B9A;&#x65F6;&#x5668;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;rdt3.0&#x7684;&#x53D1;&#x9001;&#x7AEF;&#x7684;&#x793A;&#x610F;:</p>
<p><img src="IMG/3-4-4-rdt2_2.PNG" alt=""></p>
<h4 id="&#x6D41;&#x6C34;&#x7EBF;&#x5F0F;&#x7684;-rdt30"><a name="&#x6D41;&#x6C34;&#x7EBF;&#x5F0F;&#x7684;-rdt30" class="anchor-navigation-ex-anchor" href="#&#x6D41;&#x6C34;&#x7EBF;&#x5F0F;&#x7684;-rdt30"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6D41;&#x6C34;&#x7EBF;&#x5F0F;&#x7684; rdt3.0</h4>
<p>&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x4FE1;&#x9053;&#x7684;&#x5229;&#x7528;&#x7387;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x4F7F;&#x7528;stop-and-wait&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x53D1;&#x9001;&#x8005;&#x4F1A;&#x53D1;&#x9001;&#x591A;&#x4E2A;&#x5305;&#x800C;&#x4E0D;&#x7B49;&#x5F85;&#x54CD;&#x5E94;&#x3002;&#x8FD9;&#x5BF9;&#x534F;&#x8BAE;&#x6709;&#x4E86;&#x65B0;&#x7684;&#x8981;&#x6C42;:</p>
<ul>
<li>&#x5E8F;&#x5217;&#x53F7;&#x5FC5;&#x987B;&#x589E;&#x52A0;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x53D1;&#x9001;&#x7684;&#x5305;&#x90FD;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x72EC;&#x7279;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#xFF0C;&#x6240;&#x4EE5;0-1&#x5E8F;&#x5217;&#x53F7;&#x4E0D;&#x591F;&#x4E86;&#x3002;</li>
<li>&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x7AEF;&#x5FC5;&#x987B;&#x6709;&#x80FD;&#x529B;buffer&#x66F4;&#x591A;&#x7684;&#x5305;&#xFF0C;&#x81F3;&#x5C11;&#x53D1;&#x9001;&#x8005;&#x53EF;&#x4EE5;&#x5C06;&#x90A3;&#x4E9B;&#x5DF2;&#x53D1;&#x9001;&#x5E76;&#x4E14;&#x8FD8;&#x6CA1;&#x6709;ack&#x7684;&#x5305;buffer&#x4F4F;&#x3002;</li>
<li>&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x9519;&#x8BEF;&#x6062;&#x590D;&#x65B9;&#x6CD5;:GBN&#x6216;SR</li>
</ul>
<p><img src="IMG/3-4-5-rdt3_0.PNG" alt=""></p>
<h4 id="gbngo-back-n"><a name="gbngo-back-n" class="anchor-navigation-ex-anchor" href="#gbngo-back-n"><i class="fa fa-link" aria-hidden="true"></i></a>GBN(Go-Back-N)</h4>
<p>&#x5728;GBN&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x53D1;&#x9001;&#x8005;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x591A;&#x4E2A;&#x5305;&#x800C;&#x4E0D;&#x5FC5;&#x7B49;&#x5F85;&#x56DE;&#x5E94;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x7684;&#x6570;&#x503C;N&#xFF0C;N&#x4EE3;&#x8868;&#x90A3;&#x4E9B;&#x6D41;&#x6C34;&#x7EBF;&#x4E2D;&#x672A;&#x88AB;ACK&#x7684;&#x5305;</p>
<p><img src="IMG/3-4-6-GBN.PNG" alt=""></p>
<p>&#x4E0A;&#x56FE;&#x4E2D;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;GBN&#x5E8F;&#x5217;&#x53F7;&#x793A;&#x610F;&#x56FE;&#xFF0C;base&#x6307;&#x5411;&#x4E86;&#x53D1;&#x9001;&#x4F46;&#x8FD8;&#x6CA1;&#x88AB;&#x63A5;&#x53D7;&#x7684;&#x6700;&#x8FDC;&#x5904;&#x7684;&#x5305;&#x3002;nextseqnum&#x6307;&#x5411;&#x8FD8;&#x672A;&#x53D1;&#x9001;&#x4F46;&#x662F;&#x5728;&#x7A97;&#x53E3;&#x91CC;&#x9762;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5305;&#x3002;N&#x53C8;&#x88AB;&#x79F0;&#x4F5C;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#xFF0C;GBN&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x534F;&#x8BAE;&#x3002;&#x5BF9;&#x4E8E;&#x4E3A;&#x4EC0;&#x4E48;&#x628A;&#x90A3;&#x4E9B;&#x5DF2;&#x53D1;&#x9001;&#x800C;&#x672A;&#x88AB;ack&#x7684;&#x5305;&#x4E5F;&#x8BA1;&#x7B97;&#x5728;&#x5185;&#xFF0C;&#x8FD9;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x51FA;&#x4E8E;&#x6D41;&#x63A7;&#x5236;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x5F53;&#x6211;&#x4EEC;&#x5B66;&#x4E60;TCP&#x7684;&#x963B;&#x585E;&#x673A;&#x5236;&#x65F6;&#x4E5F;&#x4F1A;&#x660E;&#x767D;&#x4E86;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x9645;&#x8FD0;&#x7528;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x5305;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x662F;&#x50A8;&#x5B58;&#x5728;&#x5305;&#x5934;&#x90E8;&#x7684;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x957F;&#x5EA6;&#x91CC;&#x9762;&#xFF0C;&#x5982;&#x679C;k&#x662F;&#x8FD9;&#x4E2A;&#x57DF;&#x7684;&#x603B;bit&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x5E8F;&#x5217;&#x53F7;&#x5C31;&#x662F;[0. 2k-1]&#x4E86;&#xFF0C;&#x5BF9;&#x4E8E;&#x6709;&#x9650;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x800C;&#x8A00;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5173;&#x4E8E;&#x5E8F;&#x5217;&#x53F7;&#x7684;&#x64CD;&#x4F5C;&#x5FC5;&#x987B;&#x8FDB;&#x884C;2&#x7684;k&#x6B21;&#x65B9;&#x53D6;&#x6A21;&#x3002;TCP&#x62E5;&#x6709;&#x4E00;&#x4E2A;32&#x4F4D;&#x5BBD;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x57DF;(TCP&#x662F;&#x4EE5;byte&#x4E3A;&#x5355;&#x4F4D;&#xFF0C;&#x800C;&#x975E;packet)&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x53D1;&#x9001;&#x7AEF;&#x7684;&#x60C5;&#x51B5;:</p>
<p><img src="IMG/3-4-7_GBN_FSM.PNG" alt=""></p>
<p>GBN&#x5FC5;&#x987B;&#x53EF;&#x4EE5;&#x88AB;&#x4E09;&#x79CD;&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;:</p>
<ul>
<li><p>&#x88AB;&#x66F4;&#x9AD8;&#x5C42;layer&#x7684;&#x8C03;&#x7528;, &#x53D1;&#x9001;&#x7AEF;&#x9996;&#x5148;&#x8981;&#x68C0;&#x67E5;&#x7A97;&#x53E3;&#x662F;&#x4E0D;&#x662F;&#x5DF2;&#x7ECF;&#x6EE1;&#x4E86;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x91CC;&#x9762;&#x6709;N&#x4E2A;&#x5DF2;&#x53D1;&#x9001;&#x672A;ACK&#x7684;&#x5305;&#x3002;&#x5982;&#x679C;&#x7A97;&#x6CA1;&#x6709;&#x6EE1;&#xFF0C;&#x4E00;&#x4E2A;&#x5305;&#x5C31;&#x4EA7;&#x751F;&#x4E86;&#x5E76;&#x4E14;&#x88AB;&#x53D1;&#x9001;&#x4E86;&#xFF0C;&#x53D1;&#x9001;&#x7AEF;&#x7684;&#x53D8;&#x91CF;&#x66F4;&#x65B0;&#xFF1A;&#x5982;nextseqnumber++&#x3002;&#x5982;&#x679C;&#x7A97;&#x53E3;&#x6EE1;&#x4E86;&#xFF0C;&#x53D1;&#x9001;&#x7AEF;&#x5C31;&#x4F1A;&#x7B80;&#x5355;&#x5730;&#x628A;&#x6570;&#x636E;&#x91CD;&#x65B0;&#x8FD4;&#x56DE;&#x7ED9;&#x66F4;&#x9AD8;&#x7684;layer&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x544A;&#x77E5;&#x9AD8;&#x5C42;&#x5F53;&#x524D;&#x7A97;&#x5DF2;&#x7ECF;&#x6EE1;&#x4E86;&#x3002;&#x66F4;&#x9AD8;&#x5C42;&#x5C06;&#x4F1A;&#x5728;&#x8FC7;&#x4E00;&#x4F1A;&#x53BB;&#x91CD;&#x65B0;&#x5C1D;&#x8BD5;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x53D1;&#x9001;&#x7AEF;&#x53EF;&#x80FD;&#x4F1A;&#x8981;&#x4E48;&#x662F;&#x7F13;&#x5B58;&#x8FD9;&#x90E8;&#x5206;&#x6570;&#x636E;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x540C;&#x6B65;&#x673A;&#x5236;&#xFF0C;&#x4F7F;&#x5F97;&#x9AD8;&#x5C42;&#x7684;layer&#x8C03;&#x7528;rdt_send&#x5F53;&#x4E14;&#x4EC5;&#x5F53;&#x7A97;&#x53E3;&#x4E0D;&#x6EE1;&#x3002;</p>
</li>
<li><p>ACK &#x5728;&#x6211;&#x4EEC;&#x7684;GBN&#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x5305;n&#x7684;&#x786E;&#x8BA4;&#x5C06;&#x88AB;&#x89C6;&#x4F5C;&#x7D2F;&#x79EF;&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x524D;n&#x4E2A;&#x5305;&#x90FD;&#x662F;&#x88AB;&#x63A5;&#x6536;&#x7AEF;&#x6B63;&#x786E;&#x63A5;&#x53D7;&#x7684;&#x3002;</p>
</li>
<li><p>&#x8D85;&#x65F6;&#x91CD;&#x4F20; &#x5982;&#x679C;timeout&#x53D1;&#x751F;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x53D1;&#x9001;&#x8005;&#x5C31;&#x4F1A;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x6240;&#x6709;&#x5DF2;&#x53D1;&#x9001;&#x7684;&#x4F46;&#x662F;&#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x786E;&#x8BA4;&#x7684;&#x5305;&#x3002;</p>
</li>
</ul>
<p><img src="IMG/3-4-8_GBN_operation.PNG" alt=""></p>
<p>&#x5BF9;&#x4E8E;GBN&#x6765;&#x8BF4;&#x63A5;&#x6536;&#x7AEF;&#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5305;(&#x5E8F;&#x5217;&#x53F7;&#x662F;n)&#x6B63;&#x786E;&#x7684;&#x63A5;&#x6536;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x6309;&#x7167;&#x987A;&#x5E8F;(&#x4E5F;&#x5C31;&#x662F;&#x4F20;&#x9001;&#x7ED9;&#x9AD8;&#x5C42;&#x7684;&#x4E0A;&#x4E00;&#x4E2A;&#x5305;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x662F;n-1),&#x90A3;&#x4E48;&#x63A5;&#x6536;&#x7AEF;&#x5C31;&#x4F1A;&#x53D1;&#x9001;&#x7ED9;&#x53D1;&#x9001;&#x7AEF;&#x54CD;&#x5E94;&#x4E00;&#x4E2A;ACK&#xFF0C;&#x5E76;&#x4E14;&#x628A;&#x5305;&#x7684;&#x6570;&#x636E;(&#x9664;&#x53BB;header&#x7B49;)&#x53D1;&#x9001;&#x7ED9;&#x9AD8;&#x5C42;&#x3002;&#x5728;&#x5176;&#x4ED6;&#x7684;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x63A5;&#x6536;&#x8005;&#x76F4;&#x63A5;&#x4E22;&#x5F03;&#x8FD9;&#x4E2A;&#x5305;&#xFF0C;&#x5E76;&#x4E14;&#x53D1;&#x9001;ACK(&#x53EA;&#x662F;&#x8FD9;&#x4E2A;ACK&#x5BF9;&#x5E94;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x662F;&#x6700;&#x8FD1;&#x63A5;&#x6536;&#x5E76;&#x4E14;&#x662F;&#x6B63;&#x786E;&#x7684;&#x90A3;&#x4E2A;)&#x3002;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x7684;GBN&#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x4E22;&#x5F03;&#x90A3;&#x4E9B;&#x987A;&#x5E8F;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x5305;&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x770B;&#x8D77;&#x6765;&#x5341;&#x5206;&#x7684;&#x611A;&#x8822;&#x548C;&#x6D6A;&#x8D39;&#x76F4;&#x63A5;&#x4E22;&#x5F03;&#x90A3;&#x4E9B;&#x6B63;&#x786E;&#x63A5;&#x53D7;&#x7684;&#x5305;&#x88F9;&#x3002;&#x5BF9;&#x4E8E;&#x63A5;&#x6536;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x4FDD;&#x7559;seqnumber&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x987A;&#x5E8F;&#x7684;&#x5305;&#x5C31;&#x597D;&#x4E86;&#x3002;&#x800C;&#x53D1;&#x9001;&#x7AEF;&#x5219;&#x9700;&#x8981;buffer&#x7A97;&#x53E3;N&#x4E0B;&#x6240;&#x6709;&#x7684;packet&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;GDB&#x534F;&#x8BAE;&#x5305;&#x542B;&#x4E86;&#x51E0;&#x4E4E;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x5B66;&#x5230;&#x7684;&#x6240;&#x6709;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x5305;&#x62EC;&#x4F7F;&#x7528;&#x5E8F;&#x5217;&#x53F7;&#xFF0C;&#x7D2F;&#x8BA1;&#x8BA4;&#x77E5;&#xFF0C;&#x6821;&#x9A8C;&#xFF0C;&#x8D85;&#x65F6;&#x91CD;&#x4F20;&#x3002;</p>
<h4 id="selective-repeat"><a name="selective-repeat" class="anchor-navigation-ex-anchor" href="#selective-repeat"><i class="fa fa-link" aria-hidden="true"></i></a>Selective Repeat</h4>
<p>GBN&#x53EF;&#x4EE5;&#x8BA9;&#x53D1;&#x9001;&#x8005;&#x5145;&#x5206;&#x5229;&#x7528;&#x6D41;&#x6C34;&#x7EBF;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;GBN&#x672C;&#x8EAB;&#x4E5F;&#x9762;&#x4E34;&#x7740;&#x6027;&#x80FD;&#x7684;&#x7F3A;&#x9677;&#x95EE;&#x9898;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5F53;&#x7A97;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x5E26;&#x5BBD;&#x5EF6;&#x65F6;&#x90FD;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BB8;&#x591A;&#x5305;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x6D41;&#x6C34;&#x7EBF;&#x4E2D;&#x3002;&#x4E00;&#x4E2A;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x5305;&#x9519;&#x8BEF;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;GBN&#x91CD;&#x4F20;&#x4E00;&#x5927;&#x90E8;&#x5206;&#x5305;&#xFF0C;&#x5F88;&#x591A;&#x90FD;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x6240;&#x547D;&#x540D;&#x7684;&#x90A3;&#x6837;&#xFF0C;Selective Repeat&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x4E00;&#x4E9B;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x91CD;&#x4F20;&#xFF0C;&#x4EC5;&#x4EC5;&#x5BF9;&#x90A3;&#x4E9B;&#x62E5;&#x6709;&#x9519;&#x5305;&#x6216;&#x8005;&#x4E22;&#x5931;&#x7684;&#x91CD;&#x4F20;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x7684;&#x63A5;&#x6536;&#x65B9;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#x7A97;&#x53E3;&#x4E2D;&#x6BCF;&#x4E2A;&#x5305;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p><img src="IMG/3-4-9_SR.PNG" alt=""></p>
<p>SR&#x63A5;&#x6536;&#x7AEF;&#x5C06;&#x5BF9;&#x90A3;&#x4E9B;&#x6B63;&#x786E;&#x63A5;&#x53D7;&#x7684;&#x5305;(&#x65E0;&#x8BBA;&#x662F;&#x5426;&#x662F;&#x987A;&#x5E8F;&#x7684;)&#x90FD;&#x4F1A;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x3002;&#x90A3;&#x4E9B;&#x987A;&#x5E8F;&#x9519;&#x8BEF;&#x7684;&#x5C06;&#x4F1A;&#x88AB;buffer&#x76F4;&#x5230;&#x4EFB;&#x4F55;&#x4E22;&#x5931;&#x7684;&#x5305;(packet&#x62E5;&#x6709;&#x5C0F;&#x7684;&#x5E8F;&#x5217;&#x53F7;)&#x88AB;&#x63A5;&#x6536;&#x3002;</p>
<p>SR&#x53D1;&#x9001;&#x7AEF;&#x7684;&#x4E8B;&#x4EF6;&#x548C;&#x52A8;&#x4F5C;&#xFF1A;</p>
<ol>
<li><p>&#x4ECE;&#x66F4;&#x9AD8;&#x5C42;&#x7684;layer&#x63A5;&#x6536;&#x5230;&#x6570;&#x636E;&#xFF0C;SR&#x6B64;&#x65F6;&#x4F1A;&#x68C0;&#x67E5;&#x4E0B;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x5730;&#x5E8F;&#x5217;&#x53F7;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x5E8F;&#x5217;&#x53F7;&#x5728;&#x53D1;&#x9001;&#x8005;&#x7684;&#x7A97;&#x53E3;&#x91CC;&#x9762;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5C31;&#x4F1A;&#x88AB;&#x6253;&#x5305;&#x5E76;&#x4E14;&#x53D1;&#x9001;&#xFF0C;&#x5426;&#x5219;&#x544A;&#x8BC9;&#x9AD8;&#x5C42;&#x88AB;&#x7F13;&#x5B58;&#x4E86;&#x6216;&#x8005;&#x8BF7;&#x6C42;&#x8FC7;&#x4E00;&#x4F1A;&#x518D;&#x4F20;&#x9001;&#x3002;</p>
</li>
<li><p>&#x8D85;&#x65F6; &#x5B9A;&#x65F6;&#x5668;&#x518D;&#x4E00;&#x6B21;&#x5730;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x53EA;&#x662F;&#x8FD9;&#x6B21;&#x6BCF;&#x4E2A;&#x5305;&#x90FD;&#x5FC5;&#x987B;&#x62E5;&#x6709;&#x5404;&#x81EA;&#x7684;&#x903B;&#x8F91;&#x5B9A;&#x65F6;&#x5668;&#x3002;</p>
</li>
<li><p>&#x5BF9;ACK&#x7684;&#x54CD;&#x5E94;&#x3002; &#x5982;&#x679C;ACK&#x53D7;&#x5230;&#x4E86;&#xFF0C;SR&#x4F1A;&#x6807;&#x8BB0;&#x90A3;&#x4E2A;&#x5305;&#x662F;&#x5DF2;&#x7ECF;&#x6536;&#x5230;&#x4E86;(&#x5047;&#x5B9A;&#x4ED6;&#x5728;window&#x91CC;).&#x5982;&#x679C;&#x5305;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x7B49;&#x4E8E;base&#xFF0C;&#x90A3;&#x4E48;window&#x5C31;&#x4F1A;&#x5411;&#x524D;&#x79FB;&#x52A8;&#xFF0C;&#x76F4;&#x5230;&#x4E00;&#x4E2A;&#x672A;ACK&#x7684;&#x5305;&#x3002;</p>
</li>
</ol>
<p>&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x4E8B;&#x4EF6;&#x548C;&#x52A8;&#x4F5C;:</p>
<ol>
<li><p>&#x5982;&#x679C;&#x662F;&#x5E8F;&#x5217;&#x53F7;&#x4E3A;[rcv_base, rcv_base + N - 1]&#x4E14;&#x6B63;&#x786E;&#x63A5;&#x6536;&#x7684;&#x5305;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x4F1A;&#x8FD4;&#x56DE;&#x7ED9;&#x53D1;&#x9001;&#x7AEF;&#x4E00;&#x4E2A;ACK(&#x5E26;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x5E8F;&#x5217;&#x53F7;)&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x5305;&#x4E4B;&#x524D;&#x6CA1;&#x6709;&#x88AB;&#x63A5;&#x6536;&#x8FC7;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x4F1A;&#x88AB;&#x7F13;&#x51B2;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x5305;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x7B49;&#x4E8E;&#x63A5;&#x6536;&#x7A97;&#x53E3;&#x7684;base&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5305;&#xFF0C;&#x548C;&#x4E4B;&#x524D;&#x6240;&#x6709;buffer&#x7684;&#x5305;&#x90FD;&#x4F1A;&#x88AB;&#x53D1;&#x9001;&#x7ED9;&#x4E0A;&#x5C42;&#x3002;&#x7136;&#x540E;&#x7A97;&#x53E3;&#x5411;&#x540E;&#x6ED1;&#x52A8;&#x3002;</p>
</li>
<li><p>&#x63A5;&#x6536;&#x5230;[rcv_base-N, rcv_base - 1]&#x5E8F;&#x5217;&#x53F7;&#x7684;&#x5305;&#x4E14;&#x6CA1;&#x6709;bit&#x9519;&#x8BEF;&#x7684;&#x8BDD;&#xFF0C;&#x4E5F;&#x8981;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x76F8;&#x5E94;&#x7684;ACK&#x3002;(&#x56E0;&#x4E3A;&#x6536;&#x53D1;&#x4E24;&#x7AEF;&#x7684;&#x7A97;&#x53E3;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#x6B65;)</p>
</li>
<li><p>&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x4E0B;,&#x5FFD;&#x7565;&#x5305;&#x3002;</p>
</li>
</ol>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x751F;&#x52A8;&#x7684;SR&#x6A21;&#x5F0F;&#x7684;&#x6D41;&#x7A0B;</p>
<p><img src="IMG/3-4-10_SR_operation.PNG" alt=""></p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#x7F3A;&#x4E4F;&#x540C;&#x6B65;&#x673A;&#x5236;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x540E;&#x679C;&#x6BD4;&#x5982;&#x5F53;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x9762;&#x5BF9;&#x4E00;&#x4E2A;&#x6709;&#x9650;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x65F6;&#x3002;&#x5047;&#x5B9A;&#x6211;&#x4EEC;&#x53EA;&#x6709;4&#x4E2A;&#x5E8F;&#x5217;&#x53F7;&#xFF0C;&#x7A97;&#x53E3;&#x5BB9;&#x91CF;&#x662F;3&#x3002;&#x5047;&#x5B9A;0-2&#x7684;&#x5305;&#x88F9;&#x90FD;&#x5DF2;&#x7ECF;&#x88AB;&#x6B63;&#x786E;&#x7684;&#x4F20;&#x9001;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x63A5;&#x6536;&#x8005;&#x7684;&#x7A97;&#x53E3;&#x65F6;4-6&#xFF0C;&#x62E5;&#x6709;&#x5E8F;&#x5217;&#x53F7;3,0,1&#x3002;&#x8003;&#x8651;&#x7B2C;&#x4E00;&#x79CD;&#x573A;&#x666F;:ACK&#x4E22;&#x5931;&#x4E86;&#x4E8E;&#x662F;&#x53D1;&#x9001;&#x8005;&#x91CD;&#x65B0;&#x4F20;&#x9001;&#x8FD9;&#x4E9B;&#x5305;&#x3002;&#x56E0;&#x800C;&#x63A5;&#x6536;&#x8005;&#x4E0B;&#x6B21;&#x4F1A;&#x6536;&#x5230;&#x5305;&#x88F9;&#x6709;&#x5E8F;&#x5217;&#x53F7;0&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x5305;&#x7684;&#x91CD;&#x4F20;&#x3002;&#x6B64;&#x65F6;&#x63A5;&#x6536;&#x7AEF;&#x4F1A;&#x6536;&#x5230;<strong>&#x7B2C;1&#x4E2A;&#x5305;&#x5E8F;&#x53F7;0&#x7684;&#x91CD;&#x4F20;</strong>&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x524D;&#x4E09;&#x4E2A;&#x5305;&#x7684;ACK&#x5747;&#x88AB;&#x6B63;&#x786E;&#x5730;&#x4F20;&#x9001;&#x4E86;&#x3002;&#x4E8E;&#x662F;&#x53D1;&#x9001;&#x8005;&#x7684;&#x7A97;&#x53E3;&#x4E5F;&#x632A;&#x5230;&#x4E86;&#x7B2C;4-6&#x7684;&#x5305;,&#x5E8F;&#x5217;&#x53F7;&#x662F;3,0,1(&#x6CE8;&#x610F;&#x6B64;&#x65F6;&#x53D1;&#x9001;&#x63A5;&#x6536;&#x90FD;&#x662F;3,0,1)&#xFF0C;&#x7136;&#x540E;&#x6B64;&#x65F6;&#x53D1;&#x9001;&#x5E8F;&#x5217;&#x53F7;&#x4E3A;3,0&#x7684;&#x5305;(&#x4E5F;&#x5C31;&#x662F;&#x7B2C;4&#x7B2C;5&#x4E2A;),&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5E8F;&#x53F7;3&#x4E22;&#x5931;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x63A5;&#x6536;&#x7AEF;&#x76F4;&#x63A5;&#x6536;&#x5230;&#x4E86;<strong>&#x7B2C;4&#x4E2A;&#x5305;&#x5E8F;&#x53F7;0&#x7684;&#x53D1;&#x9001;</strong>,&#x53EF;&#x662F;&#x5BF9;&#x4E8E;&#x63A5;&#x6536;&#x7AEF;&#x6765;&#x8BF4;&#xFF0C;&#x4ED6;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x5305;&#x662F;&#x4E0D;&#x662F;&#x91CD;&#x4F20;&#x7684;&#x7B2C;1&#x4E2A;&#x5462;?&#x4EA6;&#x6216;&#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5305;&#x3002;</p>
<blockquote>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#x5E94;&#x8BE5;&#x6EE1;&#x8DB3;:windowSize &lt;= 1/2 seqNumber</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x5047;&#x5B9A;&#x4E86;&#x8FD9;&#x4E9B;&#x5305;&#x5E76;&#x4E0D;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x4E71;&#x5E8F;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x5F53;&#x53D1;&#x9001;&#x7AEF;&#x548C;&#x63A5;&#x6536;&#x7AEF;&#x88AB;&#x4E00;&#x4E2A;&#x7269;&#x7406;&#x7EBF;&#x8FDE;&#x63A5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x81EA;&#x7136;&#x5730;&#x7ED9;&#x51FA;&#x8FD9;&#x79CD;&#x5047;&#x5B9A;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x4FE1;&#x9053;&#x8FDE;&#x63A5;&#x7684;&#x662F;&#x590D;&#x6742;&#x7F51;&#x7EDC;&#xFF0C;&#x4E71;&#x5E8F;&#x5305;&#x5C31;&#x4F1A;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x3002;&#x4E00;&#x79CD;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x53EF;&#x80FD;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x53F7;x&#x51FA;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x4FE1;&#x9053;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x751A;&#x81F3;&#x5E76;&#x4E0D;&#x5728;&#x6536;&#x53D1;&#x4E24;&#x7AEF;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x7AEF;&#x7684;&#x7A97;&#x53E3;&#x4E2D;&#x3002;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x53D1;&#x9001;&#x8005;<strong>&#x786E;&#x5B9A;</strong>&#x5148;&#x524D;&#x7684;&#x5E8F;&#x5217;&#x53F7;x&#x4E0D;&#x5728;&#x7F51;&#x7EDC;&#x91CC;&#x9762;&#x4E86;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x9501;&#x7740;&#x624D;&#x4F1A;&#x53D1;&#x9001;&#x5305;x&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x4EE5;&#x5305;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x5B58;&#x6D3B;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5BF9;&#x4E8E;TCP&#x6765;&#x8BF4;&#x5DEE;&#x4E0D;&#x591A;&#x662F;3&#x5206;&#x949F;&#x3002;(&#x597D;&#x50CF;&#x4E5F;&#x633A;&#x4E45;&#x4E86;&#x7684;)</p>
<p><strong>&#x8FD9;&#x8282;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x8981;&#x4ED4;&#x7EC6;&#x518D;&#x770B;&#x770B;&#xFF01;</strong></p>
<h3 id="35-tcp"><a name="35-tcp" class="anchor-navigation-ex-anchor" href="#35-tcp"><i class="fa fa-link" aria-hidden="true"></i></a>3.5 TCP</h3>
<p>TCP&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;connection&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x56E0;&#x4E3A;&#x5E94;&#x7528;&#x8FDB;&#x7A0B;&#x5728;&#x53D1;&#x9001;&#x6570;&#x636E;&#x4E4B;&#x524D;&#xFF0C;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x548C;&#x5BF9;&#x65B9;&#x8FDB;&#x884C;&#x63E1;&#x624B;&#xFF0C;TCP&#x4E24;&#x7AEF;&#x7684;&#x53D8;&#x91CF;&#x90FD;&#x4F1A;&#x8FDB;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x521D;&#x59CB;&#x5316;&#x7684;&#x5DE5;&#x4F5C;&#x3002;TCP&#x77E5;&#x8BC6;&#x8FD0;&#x884C;&#x5728;&#x4E24;&#x4E2A;&#x7EC8;&#x7AEF;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E2D;&#x95F4;&#x7684;router&#x4E4B;&#x7C7B;&#x7684;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x7684;TCP&#x8FDE;&#x63A5;&#x72B6;&#x6001;&#x3002;</p>
<p>TCP&#x8FDE;&#x63A5;&#x63D0;&#x4F9B;&#x5168;&#x53CC;&#x5DE5;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x5982;&#x679C;&#x8FDB;&#x7A0B;A&#x548C;&#x8FDB;&#x7A0B;B&#x4E4B;&#x95F4;&#x6709;&#x4E00;&#x4E2A;TCP&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x90A3;&#x4E48;A&#x4F20;B&#x6570;&#x636E;&#x7684;&#x540C;&#x65F6;&#xFF0C;B&#x4E5F;&#x53EF;&#x4EE5;&#x5411;A&#x4F20;&#x8F93;&#x5C40;&#x3002;TCP&#x8FDE;&#x63A5;&#x4E5F;&#x88AB;&#x79F0;&#x4F5C;&#x70B9;&#x5BF9;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x662F;&#x5728;&#x5355;&#x4E2A;&#x53D1;&#x9001;&#x8005;&#x548C;&#x63A5;&#x6536;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x3002;</p>
<p>&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x7684;&#x524D;&#x4E24;&#x6B21;&#x5E76;&#x4E0D;&#x643A;&#x5E26;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#xFF0C;&#x7B2C;&#x4E09;&#x6B21;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6570;&#x636E;&#x5305;&#x5728;&#x5176;&#x4E2D;&#x3002;</p>
<p><img src="IMG/3-5-1_TCP_buffer.PNG" alt=""></p>
<p>&#x5BF9;&#x4E8E;&#x63A5;&#x6536;&#x7AEF;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;TCP&#x4F1A;&#x628A;&#x6570;&#x636E;&#x53D1;&#x9001;&#x5230;buffer&#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E;&#x53D1;&#x9001;&#x7AEF;&#xFF0C;TCP&#x4E5F;&#x4F1A;&#x76F8;&#x5E94;&#x7684;&#x628A;&#x4ECE;&#x7528;&#x6237;&#x7AEF;&#x653E;&#x5165;buffer&#x7684;&#x6570;&#x636E;&#x6253;&#x5305;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#x3002;&#x4E0D;&#x8FC7;&#x5BF9;&#x4E8E;TCP&#x5E94;&#x4F55;&#x65F6;&#x53D1;&#x9001;buffer<strong>&#x5E76;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x89C4;&#x5B9A;</strong>&#x3002;&#x6700;&#x5927;&#x7684;&#x6570;&#x636E;&#x5305;&#x79F0;&#x4F5C;MSS&#xFF0C;&#x6700;&#x5927;&#x7684;&#x4F20;&#x8F93;&#x5355;&#x5143;&#x5BB9;&#x91CF;&#x662F;MTU&#xFF0C;&#x901A;&#x5E38;MTU&#x662F;1500bytes&#xFF0C;&#x800C;MSS&#x662F;1460bytes&#xFF0C;&#x53E6;&#x5916;40bytes&#x662F;TCP/IP&#x7684;&#x5934;&#x957F;&#x5EA6;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x521A;&#x521A;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;TCP&#x62E5;&#x6709;&#x5934;&#x90E8;&#x548C;&#x6570;&#x636E;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x5F53;TCP&#x9700;&#x8981;&#x4F20;&#x9001;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x6BD4;&#x5982;&#x7F51;&#x9875;&#x7684;&#x4E00;&#x4E2A;&#x56FE;&#x50CF;&#xFF0C;&#x901A;&#x5E38;&#x5B83;&#x4F1A;&#x88AB;&#x5206;&#x6563;&#x6210;&#x591A;&#x4E2A;&#x5927;&#x5C0F;&#x4E3A;MSS&#x7684;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x9664;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4E00;&#x822C;&#x6BD4;MSS&#x5C0F;&#x4E00;&#x70B9;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BB2;&#xFF0C;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x5757;&#x662F;&#x5C0F;&#x4E8E;MSS&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5BF9;&#x4E8E;Telnet&#x800C;&#x8A00;&#xFF0C;&#x5176;&#x4E2D;&#x7684;TCP&#x6570;&#x636E;&#x5757;&#x4E00;&#x822C;&#x53EA;&#x6709;1byte&#x3002;</p>
<p>TCP&#x7ED3;&#x6784;&#x793A;&#x610F;:</p>
<p><img src="IMG/3-5-2_TCP_structure.PNG" alt=""></p>
<ul>
<li><strong>header length field</strong> &#x4E00;&#x822C;&#x662F;&#x7A7A;&#x7684;</li>
<li><strong>options</strong> &#x4E00;&#x822C;&#x662F;&#x5F53;&#x53D1;&#x9001;&#x8005;&#x548C;&#x63A5;&#x6536;&#x8005;&#x5546;&#x91CF;MSS&#x6216;&#x8005;&#x7A97;&#x5927;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#x7528;</li>
<li><strong>flag</strong> SYN,FIN,RST&#x7528;&#x6765;&#x5F00;&#x59CB;&#x548C;&#x7ED3;&#x675F;TCP;ACK&#x7528;&#x6765;&#x54CD;&#x5E94;&#xFF0C;PSH&#x4EE3;&#x8868;&#x63A5;&#x6536;&#x8005;&#x5E94;&#x8BE5;&#x7ACB;&#x523B;&#x5C06;&#x6570;&#x636E;&#x4F20;&#x9001;&#x7ED9;&#x9AD8;&#x5C42;&#xFF1B;URG&#x4EE3;&#x8868;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x662F;&#x7D27;&#x6025;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E00;&#x822C;PSH&#xFF0C;URG&#x90FD;&#x4E0D;&#x7528;&#x3002;</li>
</ul>
<p>&#x6700;&#x91CD;&#x8981;&#x7684;TCP&#x5934;&#x90E8;&#x4FE1;&#x606F;&#x5C31;&#x662F;&#x5E8F;&#x5217;&#x53F7;&#x548C;&#x786E;&#x8BA4;&#x53F7;&#x4E86;&#x3002;&#x8FD9;&#x4E9B;&#x4F4D;&#x662F;TCP&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x7684;&#x57FA;&#x672C;&#x3002;TCP&#x628A;&#x6570;&#x636E;&#x770B;&#x4F5C;&#x662F;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x987A;&#x5E8F;&#x6392;&#x5217;&#x7684;byte&#x3002;&#x5047;&#x8BBE;&#x4F20;&#x8F93;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x62E5;&#x6709;500k bytes&#xFF0C;MSS&#x5047;&#x5B9A;&#x4E3A;1000 bytes&#xFF0C;&#x6240;&#x4EE5;&#x5E8F;&#x5217;&#x53F7;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;:</p>
<p><img src="IMG/3-5-3_TCP_segment.PNG" alt=""></p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x8FD9;&#x4E2A;&#x4E00;&#x4E2A;&#x6BB5;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x5176;&#x6240;&#x5305;&#x542B;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x5E8F;&#x53F7;&#xFF0C;&#x5BF9;&#x4E8E;&#x7B2C;&#x4E00;&#x4E2A;&#x6BB5;&#x5E8F;&#x5217;&#x53F7;&#x662F;0&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x6BB5;&#x5E8F;&#x5217;&#x53F7;&#x5C31;&#x662F;1000</p>
<p>ACK&#x5E8F;&#x5217;&#x53F7;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6240;&#x671F;&#x671B;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x53F7;&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;A&#x63A5;&#x53D7;&#x4E86;&#x4ECE;B&#x53D1;&#x9001;&#x7684;0-535byte&#xFF0C;&#x5E76;&#x4E14;&#x9A6C;&#x4E0A;&#x8981;&#x7ED9;B&#x53D1;&#x9001;&#x4E00;&#x4E2A;segment&#x3002;&#x56E0;&#x800C;HostA&#x5728;&#x7B49;&#x5F85;&#x5B57;&#x8282;536&#xFF0C;&#x6240;&#x4EE5;A&#x628A;536&#x653E;&#x5230;ack&#x91CC;&#x9762;&#x7136;&#x540E;&#x628A;&#x5B83;&#x9001;&#x56DE;B&#x3002;</p>
<p>&#x56E0;&#x4E3A;TCP&#x4EC5;&#x4EC5;&#x4F1A;&#x53D1;&#x9001;ACK&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x6570;&#x636E;&#x6D41;&#x4E2D;&#x4E0B;&#x4E00;&#x4E2A;&#x7F3A;&#x5931;&#x7684;&#x5B57;&#x8282;&#xFF0C;&#x56E0;&#x800C;TCP&#x53C8;&#x88AB;&#x79F0;&#x4F5C;&#x63D0;&#x4F9B;&#x7D2F;&#x8BA1;&#x786E;&#x8BA4;&#x3002;</p>
<p><img src="IMG/3-5-4_TCP_telnet.PNG" alt=""></p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;telnet&#x5728;&#x6536;&#x53D1;&#x4E24;&#x7AEF;&#x7684;&#x793A;&#x610F;&#x56FE;&#xFF0C;&#x867D;&#x7136;&#x7531;&#x4E8E;telnet&#x4E0D;&#x63D0;&#x4F9B;&#x52A0;&#x5BC6;&#x9010;&#x6E10;&#x88AB;ssh&#x53D6;&#x4EE3;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x57FA;&#x4E8E;TCP&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x5047;&#x8BBE;&#x7528;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x521D;&#x59CB;&#x7684;&#x5206;&#x522B;&#x662F;42&#x548C;79&#xFF0C;&#x5F53;TCP&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x540E;&#xFF0C;&#x7528;&#x6237;&#x53D1;&#x9001;seq=42,ACK=79,data=&apos;C&apos;,&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x6B63;&#x786E;&#x63A5;&#x6536;&#x540E;&#xFF0C;&#x8FD4;&#x56DE;seq=79,ACK=42,data=&apos;C&apos;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x6237;&#x8FD4;&#x56DE;seq=43,ACK=80&#x786E;&#x8BA4;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x6536;&#x5230;&#x4E86;&#x3002;</p>
<p>TCP&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;rdt&#x534F;&#x8BAE;&#x4E00;&#x6837;&#xFF0C;&#x4F7F;&#x7528;&#x8D85;&#x65F6;&#x91CD;&#x4F20;&#x673A;&#x5236;&#x6765;&#x6062;&#x590D;&#x90A3;&#x4E9B;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x786E;&#x5B9E;&#x6709;&#x4E00;&#x4E9B;&#x5FAE;&#x5999;&#x7684;&#x95EE;&#x9898;&#x7B49;&#x5F85;&#x6211;&#x4EEC;&#x53BB;&#x89E3;&#x51B3;&#xFF0C;&#x9996;&#x5148;&#x662F;&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x8D85;&#x65F6;&#x7684;&#x65F6;&#x95F4;&#x9608;&#x503C;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x80AF;&#x5B9A;&#x662F;&#x8981;&#x5927;&#x4E8E;RTT&#xFF0C;&#x5982;&#x679C;&#x5C0F;&#x4E8E;RTT&#x7684;&#x8BDD;&#xFF0C;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x91CD;&#x4F20;&#x4E5F;&#x4F1A;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;SampleRTT&#xFF0C;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x6BB5;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x6BB5;&#x5230;&#x63A5;&#x53D7;&#x8FD9;&#x4E2A;&#x6BB5;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7684;TCP&#x5B9E;&#x73B0;&#x5E76;&#x4E0D;&#x662F;&#x5BF9;&#x6BCF;&#x4E2A;&#x6BB5;&#x90FD;&#x6D4B;&#x91CF;&#x8FD9;&#x4E2A;SampleRTT&#xFF0C;&#x800C;&#x662F;&#x53EA;&#x6D4B;&#x91CF;&#x4E00;&#x4E2A;&#x5DF2;&#x53D1;&#x9001;&#x4F46;&#x662F;&#x6CA1;&#x6709;ack&#x7684;&#x6BB5;&#xFF0C;&#x5927;&#x6982;&#x6BCF;&#x6B21;RTT&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;SampleRTT&#x3002;&#x5E76;&#x4E14;&#xFF0C;TCP&#x5E76;&#x4E0D;&#x4F1A;&#x5BF9;&#x90A3;&#x4E9B;&#x91CD;&#x4F20;&#x7684;&#x6BB5;&#x8BA1;&#x7B97;SampleRTT&#x3002;&#x56E0;&#x4E3A;router&#x4E2D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x963B;&#x585E;&#xFF0C;&#x6240;&#x4EE5;SampleRTT&#x5728;&#x6BB5;&#x4E0E;&#x6BB5;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x6CE2;&#x52A8;&#x3002;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x4F30;&#x8BA1;RTT&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x8FD9;&#x4E9B;SampleRTT&#x8FDB;&#x884C;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x7684;&#x5E73;&#x5747;&#x3002;TCP&#x8FD9;&#x91CC;&#x7EF4;&#x62A4;&#x4E86;&#x4E00;&#x4E2A;&#x5E73;&#x5747;&#x503C;&#xFF0C;&#x79F0;&#x4F5C;EstimatedRTT&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;<code>EstimatedRTT=(1&#x2212;&#x3B1;)&#x22C5;EstimatedRTT+&#x3B1;&#x22C5;SampleRTT</code>&#x3B1;&#x4E00;&#x822C;&#x662F;1/8&#x3002;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x8F83;&#x8FD1;&#x7684;SampleRTT&#xFF0C;&#x6BD4;&#x91CD;&#x66F4;&#x5927;&#x3002;&#x76F8;&#x5BF9;&#x4E8E;SampleRTT&#x800C;&#x8A00;&#xFF0C;EstimatedRTT&#x8981;&#x5E73;&#x6ED1;&#x5730;&#x591A;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x6D4B;&#x91CF;RTT&#x7684;&#x53D8;&#x52A8;&#x7A0B;&#x5EA6;&#x4E5F;&#x662F;&#x6709;&#x4EF7;&#x503C;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x79F0;&#x4F5C;DevRTT&#xFF0C;&#x8868;&#x793A;SampleRTT&#x548C;EstimatedRTT&#x7684;&#x8BEF;&#x5DEE;&#x6709;&#x591A;&#x5927;&#x3002;&#x516C;&#x5F0F;&#x5982;&#x4E0B;: <code>DevRTT=(1&#x2212;&#x3B2;)&#x22C5;DevRTT+&#x3B2;&#x22C5;|SampleRTT&#x2212;EstimatedRTT|</code>&#x3B2;&#x4E00;&#x822C;&#x53D6;&#x4F5C;0.25&#xFF0C;&#x5982;&#x679C;SampleRTT&#x6CE2;&#x52A8;&#x5F88;&#x5C0F;&#xFF0C;&#x90A3;&#x4E48;DevRTT&#x5C31;&#x4F1A;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x53CD;&#x4E4B;&#x4F1A;&#x6BD4;&#x8F83;&#x5927;&#x3002;</p>
<p>&#x8FD9;&#x5E26;&#x6765;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E86;EstimatedRTT&#x548C;DevRTT&#xFF0C;&#x90A3;&#x4E48;&#x7A76;&#x7ADF;&#x91CD;&#x4F20;&#x7684;&#x65F6;&#x95F4;&#x9650;&#x662F;&#x591A;&#x5C11;&#x5462;&#xFF1F;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x5E94;&#x8BE5;&#x6BD4;EstimatedRTT&#x5927;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x91CD;&#x4F20;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x4E0D;&#x80FD;&#x592A;&#x5927;&#xFF0C;&#x5426;&#x5219;TCP&#x5BF9;&#x90A3;&#x4E9B;&#x4E22;&#x5931;&#x7684;&#x5305;&#xFF0C;&#x54CD;&#x5E94;&#x7684;&#x901F;&#x5EA6;&#x5C06;&#x4F1A;&#x4E0B;&#x964D;&#x3002;&#x6240;&#x4EE5;&#x542C;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x5E94;&#x8BE5;&#x662F;EstimatedRTT&#x52A0;&#x4E0A;&#x4E00;&#x4E9B;&#x4F59;&#x91CF;&#xFF0C;&#x8FD9;&#x4E9B;&#x4F59;&#x91CF;&#x5C31;&#x662F;DevRTT&#x4E86;&#x3002;
&#x6700;&#x7EC8;&#x7684;&#x8BA1;&#x7B97;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A; &#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;TimeoutInterval&#x88AB;&#x521D;&#x59CB;&#x5316;&#x4E3A;1&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x8D85;&#x65F6;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x5C06;&#x88AB;double,&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x8FC7;&#x65E9;&#x7684;&#x8D85;&#x65F6;&#x73B0;&#x8C61;(&#x5373;&#x6B64;&#x65F6;&#x5305;&#x5DF2;&#x7ECF;&#x6B63;&#x786E;&#x63A5;&#x6536;&#x4E86;&#xFF0C;&#x4F46;&#x662F;ACK&#x8FD8;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x6CA1;&#x6709;&#x4F20;&#x56DE;&#x6765;&#xFF0C;&#x6682;&#x65F6;&#x7684;double&#xFF0C;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x6B64;&#x95EE;&#x9898;)&#x3002;&#x7136;&#x540E;&#x4E00;&#x65E6;&#x6BB5;&#x88AB;&#x63A5;&#x53D7;&#x4E86;&#xFF0C;EstimatedRTT&#x66F4;&#x65B0;&#x4E86;&#xFF0C;&#x90A3;&#x5C31;&#x4ECD;&#x7136;&#x6309;&#x7167;&#x539F;&#x6765;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;TimeoutInterval&#x3002;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x5148;&#x524D;&#x7684;&#x5173;&#x4E8E;&#x53EF;&#x9760;&#x4F20;&#x8F93;&#x7684;&#x8BA8;&#x8BBA;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x628A;&#x6BCF;&#x4E2A;&#x5DF2;&#x88AB;&#x53D1;&#x9001;&#x4F46;&#x8FD8;&#x6CA1;&#x7528;&#x6CA1;&#x6709;&#x88AB;ACK&#x7684;&#x6BB5;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x5B9A;&#x65F6;&#x5668;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x65F6;&#x949F;&#x7BA1;&#x7406;&#x4E5F;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x8D1F;&#x62C5;&#x3002;&#x56E0;&#x6B64;&#x63A8;&#x8350;&#x7684;TCP&#x65F6;&#x949F;&#x7BA1;&#x7406;&#x4EC5;&#x4EC5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x91CD;&#x4F20;&#x7684;&#x65F6;&#x949F;&#x7BA1;&#x7406;&#x5355;&#x5143;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x91CC;&#x6709;&#x5F88;&#x591A;&#x6CA1;&#x6709;&#x88AB;ACK&#x7684;&#x6BB5;&#x3002;&#x5728;&#x8FD9;&#x8282;&#x7684;&#x8BA8;&#x8BBA;&#x4E2D;&#xFF0C;&#x53EA;&#x662F;&#x7528;&#x5355;&#x5B9A;&#x65F6;&#x5668;&#x7BA1;&#x7406;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x9AD8;&#x5EA6;&#x7B80;&#x5316;&#x7684;TCP&#x53D1;&#x9001;&#x8005;&#xFF0C;&#x4F7F;&#x7528;&#x8D85;&#x65F6;&#x673A;&#x5236;&#x6765;&#x6062;&#x590D;&#x90A3;&#x4E9B;&#x4E22;&#x5931;&#x7684;&#x6BB5;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x518D;&#x5448;&#x73B0;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x591A;&#x6B21;&#x786E;&#x8BA4;&#x548C;&#x8D85;&#x65F6;&#x673A;&#x5236;&#x7684;&#x6A21;&#x578B;&#x3002;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x8BA8;&#x8BBA;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x5B9A;&#x6570;&#x636E;&#x53EA;&#x5728;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x4F20;&#x8F93;:</p>
<pre><code>NextSeqNum = InitialSeqNumber
SendBase = InitialSeqNumber

loop (forever) {
    switch(event)
        event: data received from application above
            create TCP segment with sequence number NextSeqNum
            if (timer not running) start timer
            pass segment to IP
            NextSeqNum = NextSeqNum + length(data)
            break

        event: timer timeout //&#x8D85;&#x65F6;&#x7684;&#x5224;&#x65AD;&#x5C31;&#x662F;&#x7528;&#x521A;&#x624D;&#x90A3;&#x4E2A;&#x516C;&#x5F0F; EstimatedRTT+ 4DevRTT
            retransmit not-yet-acknowledged segment with
            smallest sequence number
            start timer
            break
        event: ACK received, with ACK field value of y
            if (y &gt; SendBase) {
                sendBase = y;
                if (there are any not-yet-acknowledged segments) { // &#x6240;&#x4EE5;&#x5B9E;&#x9645;&#x4E0A;timer&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x6700;&#x8FDC;&#x7684;&#x90A3;&#x4E2A;&#x672A;&#x88AB;ACK&#x7684;&#x6570;&#x636E;
                    start timer
                }
            }
            break;
}
</code></pre><p>&#x5373;&#x4F7F;&#x8FD9;&#x79CD;TCP&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x5FAE;&#x5999;&#x7684;&#x573A;&#x666F;</p>
<p>(1)A&#x53D1;&#x9001;&#x7ED9;B&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x6BB5;&#xFF0C;&#x5E8F;&#x5217;&#x53F7;&#x662F;92&#xFF0C;&#x62E5;&#x6709;8&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E4B;&#x540E;&#xFF0C;A&#x7B49;&#x5F85;B&#x7684;&#x56DE;&#x5E94;&#xFF0C;&#x5C3D;&#x7BA1;B&#x6536;&#x5230;&#x4E86;A&#x8FD9;&#x4E2A;&#x5305;&#xFF0C;&#x4F46;&#x662F;B&#x5BF9;A&#x7684;ACK&#x786E;&#x4E22;&#x5931;&#x4E86;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8D85;&#x65F6;&#x53D1;&#x751F;&#xFF0C;&#x6240;&#x4EE5;A&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x6BB5;&#x3002;&#x5F53;B&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x91CD;&#x4F20;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x6B64;&#x65F6;B&#x7AEF;&#x7684;&#x786E;&#x8BA4;&#x53F7;&#x662F;100&#x5E8F;&#x5217;&#x53F7;&#x5C0F;&#x4E8E;&#x8FD9;&#x4E2A;B&#x7684;&#x786E;&#x8BA4;&#x53F7;&#xFF0C;&#x6240;&#x4EE5;B&#x76F4;&#x63A5;&#x56DE;&#x4F20;&#x4E00;&#x4E2A;ACK&#x5373;&#x53EF;&#x3002;</p>
<p>(2)A&#x7ED9;B&#x8FDE;&#x7EED;&#x53D1;&#x9001;&#x4E24;&#x4E2A;&#x5305;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5305;&#x8FD8;&#x662F;&#x5E8F;&#x5217;&#x53F7;92&#xFF0C;&#x957F;&#x5EA6;8&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5305;&#x5E8F;&#x5217;&#x53F7;100&#xFF0C;&#x957F;&#x5EA6;120&#x3002;B&#x540C;&#x6837;&#x90FD;&#x6536;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x5305;&#xFF0C;&#x5E76;&#x4E14;&#x53D1;&#x56DE;&#x7ED9;A&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5462;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x6BD4;&#x8F83;&#x62E5;&#x5835;&#xFF0C;A&#x5728;&#x63A5;&#x6536;&#x5230;&#x8FD9;&#x4E2A;ACK&#x4E4B;&#x524D;&#x5C31;&#x5DF2;&#x7ECF;&#x8D85;&#x65F6;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;A&#x91CD;&#x65B0;&#x53D1;&#x9001;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x53EA;&#x5148;&#x91CD;&#x4F20;92&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x5F00;&#x59CB;timer&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F1A;&#x6536;&#x5230;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x62E5;&#x5835;&#x8FDF;&#x6765;&#x7684;ACK&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x53EA;&#x8981;ACK120&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;timeout&#x4E4B;&#x524D;&#x56DE;&#x6765;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x7B2C;&#x4E8C;&#x4E2A;&#x5305;&#x5C31;&#x4E0D;&#x4F1A;&#x91CD;&#x4F20;&#x3002;</p>
<p>(3)A&#x53D1;&#x9001;&#x7ED9;B&#x4E24;&#x4E2A;&#x7AEF;(&#x540C;2)&#xFF0C;B&#x90FD;&#x6B63;&#x786E;&#x6536;&#x5230;&#x4E86;&#x5E76;&#x4E14;&#x5206;&#x522B;&#x53D1;&#x51FA;&#x4E86;ACK100&#x548C;ACK120&#x53EA;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;ACK100&#x4E22;&#x4E86;,ACK120&#x56DE;&#x5230;&#x4E86;A(&#x5047;&#x5B9A;&#x90FD;&#x5728;timeout&#x5185;)&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;A&#x5176;&#x5B9E;&#x5C31;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;B&#x6536;&#x5230;&#x4E86;119&#x4E4B;&#x524D;&#x7684;&#x6240;&#x6709;byte&#xFF0C;&#x6240;&#x4EE5;A&#x5C31;&#x4E0D;&#x4F1A;&#x91CD;&#x4F20;&#x4EFB;&#x4F55;&#x5305;&#x3002;</p>
<h4 id="double-&#x8D85;&#x65F6;&#x65F6;&#x9650;"><a name="double-&#x8D85;&#x65F6;&#x65F6;&#x9650;" class="anchor-navigation-ex-anchor" href="#double-&#x8D85;&#x65F6;&#x65F6;&#x9650;"><i class="fa fa-link" aria-hidden="true"></i></a>double &#x8D85;&#x65F6;&#x65F6;&#x9650;</h4>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E00;&#x79CD;&#x5927;&#x591A;&#x6570;TCP&#x90FD;&#x4F1A;&#x4F7F;&#x7528;&#x7684;&#x673A;&#x5236;&#x3002;&#x5F53;&#x8D85;&#x65F6;&#x53D1;&#x751F;&#x65F6;&#xFF0C;TCP&#x91CD;&#x4F20;&#x54EA;&#x4E2A;&#x62E5;&#x6709;&#x6700;&#x5C0F;&#x5E8F;&#x5217;&#x7684;&#x5305;&#x3002;&#x4F46;&#x662F;&#x6BCF;&#x6B21;&#x91CD;&#x4F20;&#x5B83;&#x4F1A;&#x88AB;&#x65F6;&#x95F4;&#x8BBE;&#x7F6E;&#x4E3A;&#x4E24;&#x500D;&#x5148;&#x524D;&#x7684;&#x503C;&#x3002;&#x4E0D;&#x8FC7;&#x5F53;&#x91CD;&#x4F20;&#x7684;&#x8FD9;&#x4E9B;&#x5305;&#x88AB;&#x6B63;&#x786E;ACK&#x4E4B;&#x540E;&#xFF0C;&#x8D85;&#x65F6;&#x7684;&#x65F6;&#x9650;&#x53C8;&#x4F1A;&#x7531;EstimatedRTT&#x548C;DevRT&#x51B3;&#x5B9A;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5728;&#x62E5;&#x5835;&#x63A7;&#x5236;&#x4E0A;&#x6709;&#x4E00;&#x4E9B;&#x4F5C;&#x7528;&#xFF0C;&#x5982;&#x679C;source&#x4E0D;&#x505C;&#x91CD;&#x4F20;&#x5305;&#x7684;&#x8BDD;&#xFF0C;&#x62E5;&#x5835;&#x4F1A;&#x66F4;&#x52A0;&#x4E25;&#x91CD;&#xFF0C;&#x6240;&#x4EE5;TCP&#x4F1A;&#x5EF6;&#x957F;(double)&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x4ECE;&#x800C;&#x51CF;&#x5C0F;&#x7EBF;&#x8DEF;&#x7684;&#x62E5;&#x5835;&#x3002;</p>
<h4 id="&#x5FEB;&#x901F;&#x91CD;&#x4F20;"><a name="&#x5FEB;&#x901F;&#x91CD;&#x4F20;" class="anchor-navigation-ex-anchor" href="#&#x5FEB;&#x901F;&#x91CD;&#x4F20;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5FEB;&#x901F;&#x91CD;&#x4F20;</h4>
<p>&#x7531;&#x8D85;&#x65F6;&#x5F15;&#x8D77;&#x7684;&#x91CD;&#x4F20;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x4F1A;&#x5E26;&#x6765;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x5EF6;&#x65F6;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x957F;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x901A;&#x5E38;&#x53D1;&#x9001;&#x8005;&#x53EF;&#x4EE5;&#x5728;&#x8D85;&#x65F6;&#x4E4B;&#x524D;&#x68C0;&#x6D4B;&#x5230;&#x5305;&#x7684;&#x4E22;&#x5931;&#xFF0C;&#x8FD9;&#x4E00;&#x822C;&#x901A;&#x8FC7;&#x91CD;&#x590D;ACK&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x8868;&#x683C;&#x8E2A;&#x8FF9;&#x4E86;TCP&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x4EA7;&#x751F;ACK&#x7684;&#x51C6;&#x5219;:</p>
<table>
<thead>
<tr>
<th>event</th>
<th>TCP Receiver Action</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x63A5;&#x53D7;&#x5230;&#x7684;&#x5305;&#x5BF9;&#x5E94;&#x671F;&#x671B;&#x7684;&#x5E8F;&#x5217;&#x53F7;<br>&#x5E76;&#x4E14;&#x4E4B;&#x524D;&#x7684;&#x6570;&#x636E;&#x90FD;&#x88AB;ACK&#x4E86;</td>
<td>&#x5EF6;&#x65F6;ACK&#xFF0C;&#x7B49;&#x5F85;&#x6700;&#x591A;500ms&#x7528;&#x6765;&#x7B49;&#x5F85;&#x53E6;&#x4E00;&#x4E2A;&#x987A;&#x5E8F;&#x7684;&#x5305;&#xFF0C;<br> &#x5982;&#x679C;&#x4E0B;&#x4E00;&#x4E2A;&#x5305;&#x6CA1;&#x6709;&#x5728;&#x8FD9;500ms&#x5230;&#x6765;&#xFF0C;&#x5C31;&#x53D1;&#x9001;ACK </td>
</tr>
<tr>
<td>&#x63A5;&#x6536;&#x5230;&#x7684;&#x5305;&#x5BF9;&#x5E94;&#x671F;&#x671B;&#x7684;&#x5E8F;&#x5217;&#x53F7;<br>&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x5176;&#x4ED6;&#x7684;&#x5305;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x4F20;&#x8F93;ACK</td>
<td>&#x53D1;&#x9001;&#x5355;&#x72EC;&#x7684;cumulative&#x7684;ACK ??</td>
</tr>
<tr>
<td>&#x63A5;&#x6536;&#x5230;&#x7684;&#x5305;&#x8D85;&#x8FC7;&#x671F;&#x671B;&#x7684;&#x5E8F;&#x5217;&#x53F7; (&#x8FD9;&#x90E8;&#x5206;&#x79F0;&#x4E3A;gap)</td>
<td>&#x8FC5;&#x901F;&#x53D1;&#x9001;&#x591A;&#x4E2A;ACK&#xFF0C;&#x8868;&#x5F81;&#x4E0B;&#x4E00;&#x4E2A;&#x671F;&#x671B;&#x7684;&#x5E8F;&#x5217;&#x53F7; ??</td>
</tr>
<tr>
<td>&#x63A5;&#x6536;&#x5230;&#x7684;&#x5305;&#x5728;gap&#x4E2D;</td>
<td>&#x7ACB;&#x523B;&#x53D1;&#x9001;ACK </td>
</tr>
</tbody>
</table>
<p>&#x597D;&#x5427;&#x4E0A;&#x4E2A;&#x8868;&#x6211;&#x4E5F;&#x6CA1;&#x592A;&#x641E;&#x61C2;&#xFF0C;&#x8FD8;&#x662F;&#x770B;&#x56FE;&#x5427;:</p>
<p><img src="IMG/3-5-5_TCP_fast_retrans.PNG" alt=""></p>
<p>&#x5F53;&#x53D1;&#x9001;&#x7B2C;&#x4E8C;&#x4E2A;&#x5305;&#x7684;&#x65F6;&#x5019;&#x4E22;&#x5931;&#x4E86;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5305;&#x63A5;&#x53D7;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x9001;&#x65AD;&#x5F00;&#x542F;&#x8BA1;&#x65F6;(&#x56E0;&#x4E3A;&#x6B64;&#x65F6;&#x5305;2,3,4,5&#x90FD;&#x8FD8;&#x6CA1;&#x6536;&#x5230;)&#xFF0C;&#x6B64;&#x65F6;&#x7B2C;&#x4E00;&#x4E2A;&#x88AB;&#x6B63;&#x786E;&#x63A5;&#x6536;&#x4E4B;&#x540E;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x7531;&#x4E8E;&#x4E00;&#x76F4;&#x6CA1;&#x6536;&#x5230;&#x7B2C;&#x4E8C;&#x4E2A;&#x5305;&#xFF0C;&#x53C8;&#x7531;&#x4E8E;&#x7D2F;&#x8BA1;&#x786E;&#x8BA4;&#x7684;&#x7F18;&#x6545;&#xFF0C;&#x53EA;&#x4F1A;&#x53D1;&#x9001;ack100,&#x5F53;&#x53D1;&#x9001;&#x5230;&#x7B2C;&#x4E09;&#x6B21;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x9001;&#x7AEF;&#x5C31;&#x4F1A;&#x89E6;&#x53D1;&#x5FEB;&#x901F;&#x91CD;&#x4F20;&#x4E86;&#xFF0C;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x5305;2&#x3002;</p>
<h3 id="36-&#x963B;&#x585E;&#x63A7;&#x5236;&#x51C6;&#x5219;"><a name="36-&#x963B;&#x585E;&#x63A7;&#x5236;&#x51C6;&#x5219;" class="anchor-navigation-ex-anchor" href="#36-&#x963B;&#x585E;&#x63A7;&#x5236;&#x51C6;&#x5219;"><i class="fa fa-link" aria-hidden="true"></i></a>3.6 &#x963B;&#x585E;&#x63A7;&#x5236;&#x51C6;&#x5219;</h3>
<p>&#x6211;&#x4EEC;&#x5148;&#x524D;&#x63D0;&#x5230;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4E22;&#x5305;&#x4E00;&#x822C;&#x6765;&#x81EA;&#x4E8E;router&#x7684;buffer&#x4E0D;&#x591F;&#x4E86;&#xFF0C;&#x7F51;&#x7EDC;&#x4E5F;&#x5C31;&#x62E5;&#x5835;&#x4E86;&#x3002;&#x91CD;&#x4F20;&#x662F;&#x89E3;&#x51B3;&#x62E5;&#x5835;&#x7684;&#x529E;&#x6CD5;&#xFF0C;&#x4F46;&#x91CD;&#x4F20;&#x5E76;&#x4E0D;&#x662F;&#x5F15;&#x53D1;&#x7F51;&#x7EDC;&#x62E5;&#x5835;&#x7684;&#x6839;&#x672C;&#x65B9;&#x6CD5;&#x2014;&#x2014;&#x592A;&#x591A;&#x7684;&#x6E90;&#x540C;&#x65F6;&#x8BD5;&#x56FE;&#x5FEB;&#x901F;&#x5730;&#x53D1;&#x9001;&#x6570;&#x636E;&#x3002;</p>
<h4 id="361-&#x963B;&#x585E;&#x7684;&#x539F;&#x56E0;&#x548C;&#x4EE3;&#x4EF7;"><a name="361-&#x963B;&#x585E;&#x7684;&#x539F;&#x56E0;&#x548C;&#x4EE3;&#x4EF7;" class="anchor-navigation-ex-anchor" href="#361-&#x963B;&#x585E;&#x7684;&#x539F;&#x56E0;&#x548C;&#x4EE3;&#x4EF7;"><i class="fa fa-link" aria-hidden="true"></i></a>3.6.1 &#x963B;&#x585E;&#x7684;&#x539F;&#x56E0;&#x548C;&#x4EE3;&#x4EF7;</h4>
<p><strong>&#x60C5;&#x666F;1</strong>:&#x4E24;&#x4E2A;&#x53D1;&#x9001;&#x8005;&#xFF0C;router&#x62E5;&#x6709;&#x65E0;&#x9650;&#x7684;buffer&#x5BB9;&#x91CF;</p>
<p><img src="IMG/3-6-1_two_connection_inf_buffer.PNG" alt=""></p>
<p>&#x5047;&#x8BBE;AB&#x4EE5;&#x56FA;&#x5B9A;&#x901F;&#x7387;&#x3BB;&#x53D1;&#x9001;&#x6570;&#x636E;(&#x4ECE;host&#x5230;socket)&#xFF0C;&#x5E76;&#x5047;&#x8BBE;&#x4E0B;&#x9762;&#x7684;&#x4F20;&#x8F93;&#x5C42;&#x5341;&#x5206;&#x7B80;&#x5355;&#xFF0C;&#x6570;&#x636E;&#x5E76;&#x4E0D;&#x4F1A;&#x6709;&#x9519;&#x8BEF;&#x68C0;&#x6D4B;&#x548C;&#x6D41;&#x63A7;&#x5236;&#x7B49;&#x3002;&#x8FD9;&#x6837;&#x5FFD;&#x7565;&#x4E86;&#x989D;&#x5916;&#x7684;&#x5934;&#x90E8;&#x4FE1;&#x606F;&#x7684;&#x8BDD;&#x90FD;&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x4EEC;&#x90FD;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x901F;&#x7387;&#x4E3A;R&#x7684;router&#xFF0C;&#x90A3;&#x4E48;&#x5B9E;&#x9645;&#x4E0A;&#x6700;&#x7EC8;&#x5230;&#x8FBE;CD&#x7AEF;&#x7684;&#x901F;&#x7387;&#x5C31;&#x7B49;&#x4E8E;&#x3BB;&#xFF0C;&#x5F53;&#x53D1;&#x9001;&#x7AEF;&#x901F;&#x7387;&#x8D85;&#x8FC7;R/2&#x65F6;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x63A5;&#x6536;&#x7AEF;&#x4E0D;&#x4F1A;&#x518D;&#x589E;&#x52A0;&#x4E86;&#xFF0C;&#x8FD8;&#x662F;R/2&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x65F6;&#x5EF6;&#x6765;&#x8BB2;,&#x5F53;&#x63A5;&#x8FD1;R/2&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x6025;&#x901F;&#x4E0A;&#x5347;&#xFF0C;&#x56E0;&#x4E3A;&#x5305;&#x5728;buffer&#x4F1A;&#x4E00;&#x76F4;&#x5904;&#x4E8E;&#x7B49;&#x5F85;&#x3002;</p>
<p><strong>&#x60C5;&#x666F;2</strong>:&#x4E24;&#x4E2A;&#x53D1;&#x9001;&#x8005;&#xFF0C;router&#x62E5;&#x6709;&#x6709;&#x9650;&#x7684;buffer&#x5BB9;&#x91CF;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5047;&#x5B9A;&#x8FD9;&#x4E2A;&#x94FE;&#x63A5;&#x662F;&#x53EF;&#x9760;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4F1A;&#x6709;&#x91CD;&#x4F20;&#x7684;&#x73B0;&#x8C61;&#x53D1;&#x751F;&#xFF0C;&#x56E0;&#x800C;&#xFF0C;&#x5B9E;&#x9645;&#x7684;&#x3BB;`(offer load)&#x5E76;&#x4E0D;&#x662F;&#x3BB;&#x800C;&#x662F;&#x8FD8;&#x4F1A;&#x6709;&#x91CD;&#x4F20;&#x7684;&#x90E8;&#x5206;&#x3002;&#x6700;&#x5B9E;&#x9645;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x53D1;&#x9001;&#x8005;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x8FC7;&#x65E9;&#x8D85;&#x65F6;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x91CD;&#x4F20;&#x90A3;&#x4E9B;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x4E22;&#x5931;&#x7684;&#x5305;&#x3002;&#x5982;&#x679C;&#x5047;&#x5B9A;&#x6BCF;&#x4E2A;&#x5305;&#x90FD;&#x662F;&#x91CD;&#x4F20;&#x4E86;&#x4E00;&#x6B21;&#x7684;&#x8BDD;&#xFF0C;&#x6700;&#x7EC8;&#x541E;&#x5410;&#x91CF;&#x4F1A;&#x964D;&#x5230;&#x5927;&#x6982;R/4&#x3002;</p>
<p><strong>&#x60C5;&#x666F;3</strong>&#xFF1A;&#x56DB;&#x4E2A;&#x53D1;&#x9001;&#x8005;&#xFF0C;router&#x62E5;&#x6709;&#x6709;&#x9650;&#x7684;buffer&#x5BB9;&#x91CF;&#x548C;&#x591A;&#x4E2A;&#x8DEF;&#x5F84;</p>
<p><img src="IMG/3-6-2_four_senders_multi_path.PNG" alt=""></p>
<p>&#x5047;&#x5B9A;&#x6240;&#x6709;&#x7684;host&#x53D1;&#x9001;&#x6570;&#x636E;&#x7684;&#x901F;&#x5EA6;&#x90FD;&#x662F;&#x3BB;&#xFF0C;&#x5E76;&#x4E14;&#x6240;&#x6709;router&#x7684;&#x8FDE;&#x63A5;&#x901F;&#x7387;&#x6700;&#x5927;&#x662F;R bytes/sec&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x5206;&#x6790;&#x4E0B;A-&gt;C&#xFF0C;&#x8FD9;&#x4E2A;&#x8DEF;&#x5F84;&#x4F1A;&#x901A;&#x8FC7;router R1&#x548C;R2&#x3002;A-&gt;C &#x548C; D-&gt;B&#x8FDE;&#x63A5;&#x5206;&#x4EAB;R1, &#x548C;B-&gt;D&#x8FDE;&#x63A5;&#x5206;&#x4EAB;R2,&#x5982;&#x679C;&#x3BB;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;buffer&#x7684;&#x6EA2;&#x51FA;&#x53D1;&#x751F;&#x7684;&#x6982;&#x7387;&#x4F1A;&#x975E;&#x5E38;&#x5C11;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x541E;&#x5410;&#x91CF;&#x5927;&#x6982;&#x548C;&#x6700;&#x5927;&#x8D1F;&#x8F7D;&#x5DEE;&#x4E0D;&#x591A;&#x3002;</p>
<p>&#x4F46;&#x5982;&#x679C;&#x3BB;&#x6BD4;&#x8F83;&#x5927;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5BF9;&#x4E8E;R2&#x6765;&#x8BF4;&#xFF0C;B-&gt;D&#x7684;&#x6D41;&#x91CF;&#x4F1A;&#x8FDC;&#x5927;&#x4E8E;A-&gt;C(&#x56E0;&#x4E3A;&#x9760;&#x7684;&#x8FD1;&#xFF1F;)&#xFF0C;&#x56E0;&#x4E3A;A-&gt;C&#x548C;B-&gt;D&#x5FC5;&#x987B;&#x7ADE;&#x4E89;&#x8FD9;&#x4E9B;&#x6709;&#x9650;&#x7684;buffer&#x7A7A;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;A-&gt;C&#x6D41;&#x91CF;&#x5C06;&#x4F1A;&#x83B7;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#x7684;buffer&#x7A7A;&#x95F4;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x9650;&#x5236;&#x4E0B;&#xFF0C;&#x6700;&#x7EC8;R2&#x5C06;&#x4E0D;&#x4F1A;&#x5F97;&#x5230;&#x4EFB;&#x4F55;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x4E9B;&#x7F13;&#x51B2;&#x7A7A;&#x95F4;&#x5C06;&#x5168;&#x90E8;&#x88AB;B-&gt;D&#x5360;&#x636E;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x6700;&#x540E;&#x7684;&#x60C5;&#x666F;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5305;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;router&#x4E0B;&#x4E22;&#x5931;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5BF9;&#x4E8E;router&#x6765;&#x8BB2;&#xFF0C;&#x4ED6;&#x7684;&#x5DE5;&#x4F5C;&#x4E5F;&#x662F;&#x65E0;&#x7528;&#x7684;&#x3002;&#x8FD9;&#x6837;&#x5B9E;&#x9645;&#x4E0A;&#x8FD8;&#x4E0D;&#x5982;&#x76F4;&#x63A5;&#x4E22;&#x6389;&#x8FD9;&#x4E2A;&#x5305;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x770B;&#x5230;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x7531;&#x4E8E;&#x4E22;&#x5931;&#x5305;&#x9020;&#x6210;&#x7684;&#x62E5;&#x5835;&#x2014;&#x2014;&#x4ED6;&#x4F1A;&#x5BFC;&#x81F4;&#x524D;&#x9762;&#x6240;&#x6709;router&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x90FD;&#x767D;&#x8D39;&#x3002;</p>
<h4 id="362&#x89E3;&#x51B3;&#x62E5;&#x5835;&#x7684;&#x529E;&#x6CD5;"><a name="362&#x89E3;&#x51B3;&#x62E5;&#x5835;&#x7684;&#x529E;&#x6CD5;" class="anchor-navigation-ex-anchor" href="#362&#x89E3;&#x51B3;&#x62E5;&#x5835;&#x7684;&#x529E;&#x6CD5;"><i class="fa fa-link" aria-hidden="true"></i></a>3.6.2&#x89E3;&#x51B3;&#x62E5;&#x5835;&#x7684;&#x529E;&#x6CD5;</h4>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x7B80;&#x5355;&#x7684;&#x63A2;&#x8BA8;&#x4E00;&#x4E0B;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x7F51;&#x7EDC;&#x5C42;&#x662F;&#x5426;&#x663E;&#x5F0F;&#x5730;&#x63D0;&#x4F9B;&#x89E3;&#x51B3;&#x8FD0;&#x8F93;&#x5C42;&#x62E5;&#x5835;&#x4F5C;&#x4E3A;&#x533A;&#x5206;&#x3002;</p>
<p><strong>&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x62E5;&#x5835;&#x63A7;&#x5236;</strong>&#xFF1A;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7F51;&#x7EDC;&#x5C42;&#x5E76;&#x4E0D;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x663E;&#x5F0F;&#x5730;&#x652F;&#x6301;&#xFF0C;&#x5BF9;&#x4E8E;IP&#x800C;&#x8A00;&#xFF0C;&#x4ED6;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#xFF0C;TCP&#x5904;&#x7406;&#x62E5;&#x5835;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x51CF;&#x5C11;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x3002;</p>
<p><strong>&#x7F51;&#x7EDC;&#x5C42;&#x5E2E;&#x52A9;&#x89E3;&#x51B3;&#x62E5;&#x5835;</strong>: &#x6709;&#x4E86;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;router&#x4F1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x53CD;&#x9988;&#xFF0C;&#x544A;&#x77E5;&#x76EE;&#x524D;&#x7F51;&#x7EDC;&#x7684;&#x62E5;&#x5835;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x79CD;&#x53CD;&#x9988;&#x53EF;&#x80FD;&#x4EC5;&#x4EC5;&#x662F;link&#x4E2D;&#x7684;&#x4E00;&#x4E2A;bit&#xFF0C;&#x590D;&#x6742;&#x4E00;&#x70B9;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x544A;&#x77E5;&#x53D1;&#x9001;&#x7AEF;&#xFF0C;router&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x7684;&#x6700;&#x5927;&#x4F20;&#x8F93;&#x901F;&#x7387;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x5BF9;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x9ED8;&#x8BA4;&#x7684;IP&#x548C;TCP&#x800C;&#x8A00;&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x662F;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x8FC7;&#x6700;&#x8FD1;IP&#x548C;TCP&#x90FD;&#x9009;&#x62E9;&#x6027;&#x5730;&#x5B9E;&#x73B0;&#x4E86;&#x8F85;&#x52A9;&#x89E3;&#x51B3;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x7F51;&#x7EDC;&#x5C42;&#x534F;&#x52A9;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x60C5;&#x51B5;&#x53EF;&#x80FD;&#x662F;&#x76F4;&#x63A5;&#x628A;&#x4FE1;&#x606F;&#x4ECE;router&#x53D1;&#x56DE;&#x53D1;&#x9001;&#x7AEF;&#xFF0C;&#x7B2C;&#x4E8C;&#x79CD;&#xFF0C;&#x4E5F;&#x662F;&#x66F4;&#x5BFB;&#x5E38;&#x7684;&#x662F;&#xFF0C;&#x7531;&#x63A5;&#x6536;&#x8005;&#x544A;&#x77E5;&#x53D1;&#x9001;&#x7AEF;&#x963B;&#x585E;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x7B2C;&#x4E8C;&#x79CD;&#x53D1;&#x9001;&#x4F1A;&#x7528;&#x5230;&#x6574;&#x4E2A;RTT&#x65F6;&#x95F4;&#x3002;</p>
<p><img src="IMG/3-6-2_two_feedback_congestion_control.PNG" alt=""></p>
<p><div id="page-footer" class="localized-footer"><hr><p><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css"></p>
<script src="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.min.js"></script>
<div id="gitalk-container" style="margin: 5%"></div>
<script>
    const gitalk = new Gitalk({
                  clientID: '8c56e9dae52cf0da1582',
                  clientSecret: '5dc33ee4d70a65898c90f64836a44e63d25ff747',
                  repo: 'computer-network-top2down',
                  owner: 'moon548834',
                  admin: ['moon548834'],
                  createIssueManually: true,
                  id: document.title
                })
    gitalk.render('gitalk-container')
</script>
<script>
    require(['gitbook'], function(gitbook) {
                  const gitalk = new Gitalk({
                  clientID: '8c56e9dae52cf0da1582',
                  clientSecret: '5dc33ee4d70a65898c90f64836a44e63d25ff747',
                  repo: 'cyc10-rcore-tutorial',
                  owner: 'moon548834',
                  admin: ['moon548834'],
                  createIssueManually: true,
                  id: document.title
                          })
                  gitbook.events.bind('page.change', initMygitalk)
                  function initMygitalk() {
                            gitalk.render('gitalk-container')
                          }
                })
</script>
</div></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="Chap2.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 第二章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第三章","level":"1.4","depth":1,"previous":{"title":"第二章","level":"1.3","depth":1,"path":"Chap2.md","ref":"Chap2.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["chapter-fold","code","search-pro","github","ancre-navigation","localized-footer","-sharing"],"pluginsConfig":{"chapter-fold":{},"github":{"url":"https://github.com/moon548834/cyc10-rcore-tutorial"},"search-pro":{},"search":{},"localized-footer":{"filename":"gitbook/comment.html","hline":"true"},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"ancre-navigation":{"associatedWithSummary":true,"float":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showLevel":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"gitbook/website.css"}},"file":{"path":"Chap3.md","mtime":"2020-03-11T07:33:03.003Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2020-03-11T07:33:24.500Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

